{
  "announcements": [
    {
      "title": "PGIM secures Abu Dhabi Global Market licence",
      "date": "3 days ago",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nPGIM secures Abu Dhabi Global Market licence\nADGM 3 days ago\nDisclaimer\nThis is an external communication and is not an official statement or announcement from ADGM.\n\nPGIM, the $1.33 trillion global investment management business of Prudential Financial, Inc., has received Financial Services Permission (FSP) to operate in Abu Dhabi Global Market (ADGM) and has opened a new office in Abu Dhabi, located in the heart of the city’s financial district.\n\nEstablishing its local entity marks PGIM’s formal entry into the Middle East market, underscoring its commitment to serving institutional and professional clients in the region. PGIM is dedicated to providing innovative investment strategies and comprehensive client advisory services to regional investors, helping them navigate market complexities and achieve their financial goals.\n\nAs a global leader in asset management, PGIM has deep asset class expertise and risk management discipline and has served clients in the Middle East for many years. PGIM offers active management and client-focused advisory services across private and public markets, meeting client needs in private alternatives (real estate, agriculture, private equity and private credit); fixed income; equities; multi-asset solutions; and retirement and fund solutions. With a global team of more than 1,400 investment professionals, averaging 22 years of experience, across 41 offices in 19 countries, PGIM is bringing its wealth of expertise to one of the world’s most progressive financial centres in the Middle East.\n\nArvind Ramamurthy, Chief of Market Development at ADGM, said, “We are proud to welcome PGIM, one of the largest asset management companies in the world, to one of the largest financial districts in the world — ADGM. PGIM’s expansion into Abu Dhabi marks an important milestone in leveraging its unparalleled expertise and comprehensive range of services alongside ADGM’s robust ecosystem to unlock a wealth of investment opportunities in the region. Their role in driving growth and innovation in the region will strengthen ADGM’s position as a global financial powerhouse.”\n\nMohammed Abdulmalek, recently appointed as head of the Middle East for PGIM and chairman of the newly established local entity, commented, “PGIM is well equipped to offer bespoke investment solutions that align with the region’s economic growth and transformation. Abu Dhabi remains a key market for us, and the establishment of our new legal entity in ADGM emphasises our ongoing dedication to our presence in the UAE and our commitment to the Middle East. I look forward to leading PGIM’s efforts in delivering value to our clients and contributing to the financial landscape of the UAE.”\n\nPGIM also announced the appointment of Emira Socorro as senior executive officer, heading the newly opened office in Abu Dhabi and a member of the board of the local entity. With over 25 years of experience in asset management and investment banking across the United States, Europe, Asia, and the Middle East, Emira has held senior positions at J.P. Morgan Chase and Arcapita. Additionally, she has led a private advisory practice that connected Gulf Cooperation Council (GCC) family offices with Islamically compliant real estate investment opportunities in the United States and Europe, while also advising GCC family offices on their investment portfolios.\n\n download Arabic",
      "tags": [
        "pgim",
        "abu dhabi",
        "the middle east",
        "abu dhabi global market",
        "the united states"
      ],
      "url": "https://www.adgm.com/media/announcements/pgim-secures-abu-dhabi-global-market-licence"
    },
    {
      "title": "The Registration Authority at ADGM Alerts Registered Entities on Work Permits Requirements",
      "date": "4 days ago",
      "source": "ADGM RA",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nThe Registration Authority at ADGM Alerts Registered Entities on Work Permits Requirements\nADGM RA 4 days ago\n\nThe Registration Authority of Abu Dhabi Global Market (ADGM) has issued an advisory reminding all ADGM-registered entities to comply with the ADGM Employment Regulations (2019) and the Temporary Work Permit Rules (2024). As per these regulations, effective from 01st September 2024, all entities registered with ADGM must obtain and maintain valid Work Permits and Temporary Work Permits for every individual working within ADGM jurisdiction.\n\nEntities that fail to secure or renew the necessary ADGM Work Permits or Temporary Work Permits for individuals working on their premises, will be considered in a violation of the regulations and rules and may face a fine.\n\nThe ADGM’s Registration Authority (RA) also warned that late filing penalties may be imposed on non-compliant entities.\n\nAs the sole authority responsible for issuing Work Permits and Temporary Work Permits within ADGM, the RA reserves the right to initiate enforcement actions for non-compliance without further notice.\n\nADGM-registered entities can submit applications for ADGM Work Permits and Temporary Work Permits through the ACCESSADGM portal. For additional resources:\n\nFor more information on how to Register for a Company User account, click here;\nTo view the Work Permit Guide on the requirements and learn about the applications requirements and steps, click here;\nTo view the RA Circular No. (2) of 2024: Requirement to obtain and maintain Work Permits and Temporary Work Permits, click here.\n\nFor further enquiries regarding Work Permits requirements, please contact: accessadgm.cases@adgm.com.\n\n download Arabic",
      "tags": [
        "the registration authority",
        "temporary work permits",
        "the adgm employment regulations",
        "the temporary work permit rules",
        "the adgm’s registration authority"
      ],
      "url": "https://www.adgm.com/media/announcements/adgm-ra-alerts-registered-entities-on-work-permits-requirements"
    },
    {
      "title": "Leon Black selects Abu Dhabi as first international outpost for his Family Office",
      "date": "09/09/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nLeon Black selects Abu Dhabi as first international outpost for his Family Office\nADGM 09/09/2024\nDisclaimer\nThis is an external communication and is not an official statement or announcement from ADGM.\n\nLeon Black, the esteemed founder of Apollo Global Management and a leading figure in private equity with a net worth in excess of $14 billion, has established a new branch of his family office, Elysium Management, at Abu Dhabi Global Market (ADGM). This strategic move underscores Black’s deep ties with the region, cultivated over 30 years through his leadership at Apollo, a global alternative asset manager with nearly $700bn under management currently and reflects his growing commitment to making a deeper push within the region.\n\nThe new office, Scimitar, will serve as Elysium's first international office. Scimitar has brought on a team of seasoned professionals, including Abu Dhabi-based financier Asad Hussaini. Hussaini, alongside Black’s son Ben, will build out the credit platform Fortinbras.\n\nBlack, known not only for his financial acumen but also for his passion as a philanthropist and prolific art collector, highlighted the significance of his long-standing relationship with Abu Dhabi. “I’ve long admired and respected the people of Abu Dhabi who are at the core of driving the development of UAE and the entire Gulf Region,” Black said in a statement. “I’ve been coming here for more than 30 years and the growth and prosperity that has occurred under Abu Dhabi’s visionary leadership is truly remarkable. My family office wants to be a part of that transformation and, more importantly, be an active member of this community. Having an office with local executives leading it is critical to our strategy and demonstrates our commitment.”\n\nADGM, the International Financial Centre of the UAE’s capital, Abu Dhabi, welcomed this move. \"We are delighted to welcome Mr. Leon Black and Elysium Management to ADGM. Mr. Black brings with him a wealth of experience and an unwavering commitment to excellence, further contributing to our thriving ecosystem. This move not only reflects the deep ties between Mr. Black and the region but also underscores the importance of ADGM as a strategic base for leading global family offices. The establishment of the first international office for Elysium highlights Abu Dhabi as the destination of choice for global entities to grow their businesses and expand within the MEASA region and beyond.\"\n\nElysium Management’s expansion into the ADGM, coupled with its seasoned team and strategic leadership, signals a new chapter in the firm’s global ambitions, positioning it at the heart of one of the world’s most influential financial centres.\n\n download Arabic",
      "tags": [
        "abu dhabi",
        "leon black",
        "black",
        "the region",
        "apollo global management"
      ],
      "url": "https://www.adgm.com/media/announcements/leon-black-selects-abu-dhabi-as-first-international-outpost-for-his-family-office"
    },
    {
      "title": "The Registration Authority of ADGM publishes Consultation Paper on Commercial Permits Regulations",
      "date": "09/09/2024",
      "source": "ADGM RA",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nThe Registration Authority of ADGM publishes Consultation Paper on Commercial Permits Regulations\nADGM RA 09/09/2024\n\nThe Registration Authority (RA) of ADGM has issued a Consultation Paper to explain and to seek public feedback and comments on the proposed Commercial Permits Regulations 2024 and subordinate rules.\n\nThe Commercial Permits Regulations 2024 and subordinate rules aim to establish a framework for obtaining, renewing, and maintaining commercial permits in relation to certain activities in ADGM.\n\nThis Consultation Paper is of interest to all licensed persons in ADGM, their directors, officers, employees and advisors. Feedback from other stakeholders, whether based in the ADGM or beyond, is also welcome.\n\nThe key features of the RA’s proposals are as follows:\n\nIntroducing a requirement to obtain a commercial permit from the RA with respect to certain activities.\nEstablishing specific conditions applicable to Alcohol or Shisha Permits.\nProviding the fees payable to the RA in connection with the issuance and renewal of annual or temporary Alcohol and Shisha Permits.\n\nTo view the Consultation Paper, please click here: Consultation Paper No. 8 of 2024 – Commercial Permits Regulations.\n\nThe consultation period will close on 29 September 2024.\n\n download Arabic",
      "tags": [
        "the registration authority",
        "ra",
        "shisha permits",
        "the registration authority of adgm publishes consultation paper",
        "alcohol"
      ],
      "url": "https://www.adgm.com/media/announcements/the-ra-of-adgm-publishes-consultation-paper-on-commercial-permits-regulations"
    },
    {
      "title": "100 Days to Abu Dhabi Finance Week: 2024 Edition Expands to 50 Events",
      "date": "30/08/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\n100 Days to Abu Dhabi Finance Week: 2024 Edition Expands to 50 Events\nADGM 30/08/2024\nFive global leadership forums including the Abu Dhabi Economic Forum, Asset Abu Dhabi, RESOLVE 2024, Fintech Abu Dhabi and Abu Dhabi Sustainable Finance Forum (ADSFF) will be returning for another edition as part of ADFW’s four-day event series\nAn extravagant plan of 50 events includes newly introduced forums for 2024 such as the UBS Investment Forum, the China UAE Investment Summit with HSBC, Islamic Finance Summit, the Spear’s Private Wealth Summit, and the Abu Dhabi Capital Markets Showcase.\n\nUnder the patronage of His Highness Sheikh Khaled bin Mohamed bin Zayed Al Nahyan, the Crown Prince of Abu Dhabi, and Chairman of the Executive Council, the third edition of Abu Dhabi Finance Week (ADFW), the flagship financial event of the MEASA region hosted by ADGM, unveiled today an extravagant plan of 50 events and sub-events. In June, Abu Dhabi Finance Week (ADFW), announced its third edition under the theme ‘Welcome to the Capital of Capital’, which will run from 9th December to 12th December 2024 and will explore the multiple facets that contribute to Abu Dhabi’s position as the ‘Capital of Capital’ focussing on financial, human, cultural, environmental and technological facets of the capital.\n\nADFW 2023: A Gathering of Titans with USD 30 Trillion in Global Assets.\n\nLast year’s edition of ADFW was a grand success, hosting over 3,300 Chairmen, CEOs, COOs, Managing Directors, Regional CEOs and Executive-level representatives from leading global financial firms, industry experts, policymakers, regulators, investors, and bankers engaged in lively discussions that debated the theme, ‘Investing in the Transition Era’ and highlighted Abu Dhabi’s growing prospects. The event's attendees represented global financial firms from various sectors collectively managing over USD 30 trillion in assets – a whopping 22% of the worldwide economy.\n\nWith the event line-up for this year, ADFW is ready to take it up a notch and deep dive into another set of trending global topics within the financial industry throughout the four days of the event series which will kick off with an opening ceremony on the 9th of December 2024 featuring an exclusive guestlist of the world’s top financial leadership and economic leaders of Abu Dhabi. Setting the stage for ADFW’s third edition, the ceremony will set the tone and agenda for hundreds of pivotal conversations that will be held over the week ahead. after the Opening Ceremony, ADFW will see the return of one of its most successful events from last year - the Abu Dhabi Economic Forum. The forum will analyse the strategies, policies and investments defining the future of Abu Dhabi’s Falcon Economy, as it convenes the most senior leaders from the host Government and the leadership of multiple international financial institutions contributing to both Abu Dhabi’s Economic Growth, and the global markets. There are also other side events scheduled to take place on the same day such as the ADEF Private Leadership Forum, Abu Dhabi Capital Markets Forum, and the prestigious ADGM Gala Dinner.\n\nThe third edition of the flagship Investors Conference ‘Asset Abu Dhabi’ will be held on 10th December, the second day of ADFW, alongside the much-awaited latest edition of the International Dispute Resolution Conference ‘RESOLVE’.\n\nExploring the Future of Investment: Asset Abu Dhabi 2024.\n\nThis year’s Asset Abu Dhabi will build on the success of the 2023 edition and will continue to shed light on topics such as the evolution of public and private markets, investing in the next decade of technology, investing in cities of the future, and insights derived from the world’s biggest hedge funds. The agenda will include the perspectives of institutional capital and asset allocators in a changing investment landscape. Held as a public forum, Asset Abu Dhabi will convene asset allocators and asset managers, investment bankers, VCs, PEs, family offices and other institutional investors. Insightful side events on the second day include the UBS Investment Forum, International Family Office Congress, T.R.I. (Turnaround, Restructuring and Insolvency) Summit, Spear’s Private Wealth Forum and Venture Stage – Startup Campus.\n\nResilience in Dispute Resolution: Navigating Challenges at RESOLVE 2024.\n\nMeanwhile, RESOLVE will gather key stakeholders representing the international dispute resolution community, as well as leaders from government, industry, technology and academia. Held under a theme of ‘Resilience’, the latest edition of RESOLVE returns to address the challenges faced by dispute resolution professionals including, finding a resilient mindset, winning negotiations, the effect of technology on better dispute resolution and the sector's value and contributions to supporting more robust businesses.\n\nShaping the Future of Finance: Fintech Abu Dhabi 2024 at ADFW.\n\nMENA’s biggest fintech festival – Fintech Abu Dhabi will return for its eighth edition at ADFW on 11th December 2024, the third day of ADFW. Tech innovators, developers, scientists, entrepreneurs and alternative investors will convene to showcase and stimulate the future of finance, across areas of payment, digital assets, digital security and credit. Alongside Fintech Abu Dhabi, several key topics will be covered through dedicated side events such as the Global Financial Regulators Summit, AI Forum, Blockchain Abu Dhabi, Risk 4.0 Risk & Security Forum, DLT Foundations Roundtable, Islamic Finance Summit and MENA Fintech Awards.\n\nLeading the Green Finance Revolution: Abu Dhabi Sustainable Finance Forum 2024.\n\nThe final day of ADFW will host the 7th edition of the Abu Dhabi Sustainable Finance Forum (ADSFF) on 12th December 2024. After the successful special edition held at COP28 last year, ADSFF is set to become a part of ADFW in 2024 and underscores the overall commitment of the event series to climate finance development. Talks and sessions on Regulation, Awareness, Collaboration and Ecosystem will be held to showcase how Abu Dhabi and ADGM are taking the lead in sustainable green finance. ADSFF will provide the ideal platform for strategy and high-level discussions on achieving not just the UAE’s net-zero ambitions but also contributing to the world's transition to a sustainable future. Other key side events during ADFW include Women in Finance, ADGM Academy (ADGMA) Showcase, Youth in Finance and Philanthropy Summit.\n\nGlobal Insights and Strategic Dialogues: UAE-China Summit and UBS Investment Forum.\n\nIn a July announcement, ADGM also disclosed hosting the UAE-China Summit presented by HSBC, which is slated to be one of the sub-events this year. The UBS Investment Forum, another addition to the list of sub-events this year, will also bring forth insightful discussions with some of the major global representatives including C-Suites from UBS.\n\nWith an unprecedented breadth and depth of programming, along with becoming one of the world’s leading conventions for International financial leadership, ADFW 2024 is set to make a significant impact with its diverse lineup of events, reflecting Abu Dhabi's dedication to fostering innovation and sustainable growth within the global financial landscape. As the emirate continues to strengthen its position on the world stage, ADFW 2024 will serve as a pivotal moment for meaningful dialogue, collaboration, and progress in the financial sector and continue on its path as one of the world’s fastest-growing financial event platforms.\n\nFor more information please visit: www.abudhabifinanceweek.com\n\n download Arabic",
      "tags": [
        "abu dhabi",
        "adfw",
        "fintech abu dhabi",
        "the ubs investment forum",
        "asset abu dhabi"
      ],
      "url": "https://www.adgm.com/media/announcements/100-days-to-abu-dhabi-finance-week-2024-edition-expands-to-50-events"
    },
    {
      "title": "ADGM Successfully Concludes Third Edition of Summer Internship Programme",
      "date": "29/08/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nADGM Successfully Concludes Third Edition of Summer Internship Programme\nADGM 29/08/2024\nIn a joint effort with ADGM Academy (ADGMA) and sponsored by ADNOC Global Trading, this year's programme enrolled over 100 students.\n\nADGM, the leading international financial centre of UAE’s capital, announces the successful conclusion of the third edition of its Summer Internship Programme. This year’s programme, conducted in collaboration with ADGM Academy (ADGMA), the knowledge arm of ADGM, and sponsored by ADNOC Global Trading, welcomed over 100 students. Building on the achievements of previous editions, the programme continues to be a valuable opportunity for young people to gain early exposure to the finance sector and develop foundational skills for their future careers.\n\nThe two-week intensive programme, which began on August 5th, featured a dynamic lineup of sessions and workshops designed to equip participants with essential skills and knowledge. Key areas of focus included Financial Literacy, Sustainable Finance, The Future of Entrepreneurship, and Effective Presentation and Public Speaking Skills. Tailored for two distinct age groups 12-15 and 16-18, the programme ensured high quality content and engaging participation. With a packed agenda, students gained valuable insights through hands-on experiences, including visits from a MA’AN team to provide a deeper understanding of social impact initiatives. They also visited Hub 71, enriching participants with insights into the role of tech startups in the ecosystem and their vital contributions to advancing it. Additionally, participants explored key trends and developments in the finance sector through an informative session on Abu Dhabi Finance Week (ADFW). The combination of practical workshops and real-world exposure offered a comprehensive learning experience that enriched their knowledge and skills. ADGM Academy is committed to deliver world class education, showcasing the importance of knowledge sharing and skills development.\n\nCommenting on the internship, Jassim Al Marzooqi, Senior Director, ADGM Academy & Research Centre said: “This programme is a testament to ADGM’s dedication to supporting and empowering the youth of our nation. Through this initiative, we aim to provide young individuals with the skills and knowledge necessary to excel in the future job market. Both ADGM and ADGM Academy are committed to shaping a brighter financial future for the next generation, and we view this programme as a significant step in that direction. By encouraging exploration of diverse career paths and enhancing understanding of the business world, we strive to cultivate the next generation of industry leaders. We also extend our sincere thanks to ADNOC Global Trading for their invaluable partnership, which has been instrumental in making this year’s programme a success”\n\nCommenting on their sponsorship, Humaid Al Zaabi, Senior Vice President Shared Services at ADNOC Global Trading, said: “ADNOC is committed to providing practical opportunities for our youths to learn new skills and build successful careers to drive the UAE’s continued progress. We are proud to partner with ADGM on its Summer Internship Programme and will continue to support initiatives that empower our youths and help them unlock their full potential.”\n\nBy boosting financial literacy and fostering entrepreneurial skills, ADGM's internship programme contributes to the broader finance industry landscape, enhancing the education and preparedness of future leaders.\n\n download Arabic",
      "tags": [
        "adgm academy",
        "adnoc global trading",
        "financial literacy",
        "global trading",
        "uae"
      ],
      "url": "https://www.adgm.com/media/announcements/adgm-successfully-concludes-third-edition-of-summer-internship-programme"
    },
    {
      "title": "Alpha Financial Markets Consulting Opens a New Branch in Abu Dhabi",
      "date": "28/08/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nAlpha Financial Markets Consulting Opens a New Branch in Abu Dhabi\nADGM 28/08/2024\nDisclaimer\nThis is an external communication and is not an official statement or announcement from ADGM.\n\nAlpha Financial Markets Consulting (“Alpha FMC”), a global provider of specialist consultancy services to the financial services industry, is pleased to announce the opening of a new branch in Abu Dhabi Global Market (ADGM), the international financial centre of the UAE's capital.\n\nWith this new branch, the firm's first in the region, Alpha is well positioned to provide tailored consultancy services to the investment management sector operating in Abu Dhabi and the wider Middle East.\n\nAlpha FMC brings a wealth of expertise and experience, offering management and technology consulting services, crossing both public and private markets. By establishing a presence in ADGM, the firm aims to contribute to the growth and success of the local financial industry while collaborating with clients and partners to navigate the complexities of today's rapidly evolving market landscape.\n\nAlpha Financial Markets Consulting is a leading global provider of specialist consultancy services to the financial services industry. With a reputation for excellence and innovation, and over twenty years of experience in the industry, Alpha helps clients navigate the challenges of the evolving financial landscape. The firm's dedicated team of experts provides a broad range of consulting services, including strategy development, operational improvement, and technology solutions. The new branch in ADGM will be overseen by and form part of Alpha’s UK business, ensuring seamless service and consistent delivery of the firm’s global expertise.\n\nTom Whitson, MENA Regional Lead, Asset & Wealth Management Consulting, commented: \"We are delighted to announce the opening of our new branch in Abu Dhabi and ADGM. Our ambition is to support financial services clients globally in optimising their value proposition and internal processes, and this branch is an important step as we establish our presence in the Middle East region. We are excited that we will be able to provide clients in Abu Dhabi and in the wider Middle East closer access to our unrivalled expertise, innovative solutions and sector insights. We look forward to collaborating closely with local clients, building lasting relationships, and contributing to the continued growth of the financial industry in the region.\"\n\nChris Kroeger, Head of UK and MENA, Asset & Wealth Management Consulting, commented: \"We are thrilled to announce the launch of Alpha FMC in the international financial centre of Abu Dhabi, ADGM, marking a significant milestone in our global expansion. This move underscores our commitment to bringing our specialized Investment Management industry consulting expertise to the region. By establishing a presence in Abu Dhabi, we are poised to deliver tailored solutions that address the unique challenges and opportunities of the Middle Eastern market, furthering our mission to help clients achieve sustainable growth and success.\"\n\nArvind Ramamurthy, Chief of Market Development at ADGM, said, “We welcome Alpha Financial Markets Consulting to Abu Dhabi and ADGM. The establishment of Alpha FMC’s new branch underscores the strategic importance of ADGM as a leading international financial centre and a hub for innovation in the region. With their extensive expertise in financial services consultancy, Alpha FMC is well-positioned to contribute to the local financial ecosystem, offering tailored solutions that address the unique challenges and opportunities of the Middle Eastern market. We look forward to witnessing their growth and valuable contributions to the continued development of Abu Dhabi’s financial industry.”\n\n download Arabic",
      "tags": [
        "abu dhabi",
        "alpha financial markets consulting",
        "alpha fmc",
        "the region",
        "alpha"
      ],
      "url": "https://www.adgm.com/media/announcements/alpha-financial-markets-consulting-opens-a-branch-in-abu-dhabi"
    },
    {
      "title": "Aurem's Unified Wealth and Benefits Platform for Workplaces",
      "date": "27/08/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nAurem's Unified Wealth and Benefits Platform for Workplaces\nADGM 27/08/2024\nDisclaimer\nThis is an external communication and is not an official statement or announcement from ADGM.\nAurem is a pioneering platform delivering workplace wealth and benefits technology regionally and globally\nTheir technology will be a key component of the End of Service Benefits reforms, a $100bn opportunity\nThe ADGM license will support their continued efforts to transform workplace savings and investing in the UAE\n\nAurem, the UAE’s first unified workplace wealth and benefits technology platform, announces its licensing by the Financial Services Regulatory Authority (FSRA) of Abu Dhabi Global Market (ADGM), marking a significant milestone in the company's mission to connect the world for a better financial future. The company is spearheading a new emerging trend of offering long-term employee benefits and investment plans in the UAE, a $100 billion market opportunity.\n\nAurem’s solutions create value for providers and employers across the workplace benefits value chain. Their proprietary platform offers innovative technology and operational efficiency to deliver an unparalleled user experience. This bridges the gap between employers and employees, offering a set of comprehensive products and tools that scale effortlessly with a businesses needs. Today, the platform offers gratuity, pension plans, saving plans, long-term incentive plans (LTIPs) and flexible benefits for the workplace. The focus on creating simplicity, and exceptional design removes the friction that’s typically faced when trying to offer employee benefits locally or globally.\n\nMichael Watkins, Founder of Aurem commented, “Securing the ADGM license marks another key milestone in Aurem's journey to deliver the future of workplace wealth and benefits technology regionally, and globally. We’re a focused, fast-moving company, with significant momentum going into our next phase of growth, and we’re excited to deliver an exceptional product to our partners today and in the future. This license will support our continued efforts to innovate in the UAE from our HQ in Abu Dhabi. As always, we’re thankful to our incredible team, and our investors, Further Ventures, and MEASA Partners for their continued support.”\n\nObtaining the Category 4 Arranging Deals in Investments license from the FSRA allows Aurem to engage in a range of regulated activities focused on investment services. This license enables Aurem to facilitate transactions involving various financial products as well as operate sophisticated financial marketplaces and investment platforms.\n\nArvind Ramamurthy, Chief of Market Development at ADGM, said: “ “We are pleased to welcome Aurem to ADGM’s dynamic ecosystem. At ADGM, we are committed to fostering a forward-thinking financial environment, and Aurem’s cutting-edge platform aligns seamlessly with our vision. By obtaining this license, Aurem solidifies its position as a key player in the wealth and benefits technology sector and establishes a strong foundation for its growth, supporting the UAE’s ambition to become a long-term hub for innovation. We look forward to witnessing Aurem’s continued success and the positive impact their solutions will bring to the market.”\n\n download Arabic",
      "tags": [
        "aurem",
        "uae",
        "this license",
        "the financial services regulatory authority",
        "fsra"
      ],
      "url": "https://www.adgm.com/media/announcements/aurem-unified-wealth-and-benefits-platform-for-workplaces"
    },
    {
      "title": "Proposed Regulatory Framework for the issuance of Fiat-Referenced Tokens",
      "date": "20/08/2024",
      "source": "ADGM FSRA",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nProposed Regulatory Framework for the issuance of Fiat-Referenced Tokens\nADGM FSRA 20/08/2024\n\nThe Financial Services Regulatory Authority (FSRA) of Abu Dhabi Global Market (ADGM) has published Consultation Paper No. 7 of 2024 containing proposals to enhance its regulatory framework to allow the issuance of Fiat-Referenced Tokens (FRTs) from the ADGM and invites public feedback and comments on the proposals.\n\nFRTs are a category of stablecoins that are backed by high-quality, liquid assets denominated in the same currency as the FRT and that can be liquidated rapidly with minimal adverse price effect. FRTs are intended to be used as a means of payment and share certain characteristics with Stored Value.\n\nSince the introduction of its original regulatory framework in 2018 for digital assets, the FSRA’s treatment of them has evolved significantly to reflect advances in this area. While the most recent version of the FSRA’s “Guidance - Regulation of Virtual Asset Activities in ADGM” (December 2023) discussed stablecoins in general and distinguished them from Virtual Assets, the FSRA’s legislation will now specifically address FRTs and their issuance.\n\nThe FSRA is proposing to adopt a risk-based and proportionate approach to FRT issuance in response to industry demand, based on appropriate regulatory requirements that incorporate the necessary safeguards to ensure that FRT issuers operate in a safe and sound manner and informed by current practices in leading jurisdictions. Issuance of FRTs would constitute a new Regulated Activity, distinct from the issuance of Stored Value within the Financial Services and Markets Regulations 2015 (“FSMR”), with commensurate conduct of business and prudential requirements.\n\nThe consultation period will close on 3 October 2024.\n\nTo view the consultation materials please click: Consultation Paper No. 7 of 2024 – Proposed Regulatory Framework for the Issuance of Fiat-Referenced Tokens.\n\n download Arabic",
      "tags": [
        "fsra",
        "the issuance",
        "fiat-referenced tokens",
        "stored value",
        "frt"
      ],
      "url": "https://www.adgm.com/media/announcements/proposed-regulatory-framework-for-the-issuance-of-fiat-referenced-tokens"
    },
    {
      "title": "ADGM Continues Rapid Growth, Issues 1,271 New Licences in H1 2024: Assets Under Management Increase by 226%",
      "date": "14/08/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nADGM Continues Rapid Growth, Issues 1,271 New Licences in H1 2024: Assets Under Management Increase by 226%\nADGM 14/08/2024\nA surge of 226% in Assets Under Management was reported in H1 2024 compared to H1 2023.\n112 asset and fund managers now operate in ADGM, managing 141 funds.\nThe number of new licences grew by 20.5% compared to H1 2023.\nWorkforce grew by over 2,500 at the end of H1 2024 compared to the same period last year.\nADGM Al Reem Island Expansion fuels a residential surge with the island’s occupancy rate reaching more than 92% at the end of June 2024.\n\nADGM, the international financial centre (IFC) of the UAE’s capital, continues its impressive growth trajectory, reporting exceptional performance in the first half of 2024. As the fastest-growing financial centre and the only jurisdiction with the direct application of the English Common Law in the region, ADGM’s consistent achievements and strategic initiatives are a catalyst to the growth of Abu Dhabi’s financial sector growth.\n\nThe momentum of ADGM bolsters the financial sector's contribution to Abu Dhabi’s non-oil economy, which grew to 9.7% in Q1 2024. ADGM is increasingly becoming a global magnet for asset management firms, outstanding talent, and investments, and is a cornerstone in cementing Abu Dhabi’s position as the ‘Capital of Capital’.\n\nCommenting on ADGM’s continued growth and strong performance, H.E. Ahmed Jasim Al Zaabi, Chairman of ADGM said, \"As a catalyst for Abu Dhabi’s financial sector, ADGM’s remarkable growth in the first half of 2024 fosters Abu Dhabi's position as a premiere hub and a destination of choice for global, regional and local corporations and financial institutions. ADGM's strategies have been aligned with Abu Dhabi's visionary leadership to position the UAE's capital as a leading international financial centre. Through the establishment of a thriving ecosystem and our pursuit of innovation, excellence, and strategic development, we are proud to have propelled towards the exceptional success of realising the ADGM Growth Strategy 2023-2027 targets, underscoring the accelerated growth of Abu Dhabi’s financial industry.”\n\nHe added, “ADGM's contribution to Abu Dhabi's stature as a global financial powerhouse and its sustainable economic growth will continue to capitalise on opportunities that will further elevate Abu Dhabi’s Falcon Economy to unprecedented heights throughout this exceptionally successful year and beyond.”\n\nSurge in Operational Entities and New Licences Reflect Strong Growth\n\nOne of the factors that has supported ADGM’s strong growth in H1 2024 is the significant increase in operational entities, which have risen to 2,088, including 231 financial services entities – a 31% increase in operational entities compared to H1 2023. This growth is also complemented by the number of Financial Services Permissions (FSP) granted in the first six months, equivalent to 42 – a growth of over 90% compared to the June 2023 numbers which stood at 22.\n\nMoreover, the number of licences issued at the end of June 2024 showcased 1,271 new licences - 20.5% more licences than a year earlier.\n\nFinancial Services Sector Led by Asset Management Positions Abu Dhabi as the Region’s Financial Hub\n\nThe asset management sector within ADGM continues to thrive, with a notable surge in AUM, global asset managers, firms and funds being anchored. In the first six months of 2024, AUM grew by 226% compared to the same period last year. By the end of June 2024, the number of fund and asset managers operating in ADGM reached 112, managing 141 funds.\n\nSome of the major names within the asset management sector that have been granted an FSP include AXA IM, Eiffel Investment ME, GQG Partners, SS&C Financial Services, and Morgan Stanley. Furthermore, several entities within this space have also received their In-Principle Approval (IPA) including Aspen Digital, Blantyre Capital, Blue Owl, Fiera Capital, Infini Capital, I Squared Capital, Ninety One Gulf Capital, Peninsula, Token Bay Capital, Triton, and Vizier. The pipeline of entities within the asset management sector remains strong across hedge funds, private equity, institutional funds and venture capital firms set to be anchored in ADGM.\n\nWhile asset management continues to lead the growth of ADGM, additional financial services entities across banking, payment services, wealth management and insurance sectors have also joined the ADGM ecosystem by receiving either an FSP or an IPA. The list of granted FSPs within these sectors includes Barrenjoey, Deutsche Bank AG, Fidelis OPCO, Laser Digital, and Paxos Issuance MENA. Prominent list of names that received an IPA includes Oyster Reinsurance Brokers, and SMBC Bank International, among others.\n\nIn May 2024, ADGM hosted the second edition of the UAE-France Investors Meetup – an exclusive gathering, led by His Excellency Bruno Le Maire, the French Minister of Economy, Finance, and Industrial and Digital Sovereignty and attended by 24 French Asset Management firms with USD 1.6 Trillion AUM. The Meetup represented a unique opportunity for stakeholders in both countries to forge strategic alliances, identify new opportunities, and drive mutual growth. It reaffirmed Abu Dhabi’s position as a global financial hub and underscored the enduring strength of the Franco-Emirati partnership.\n\nBringing Abu Dhabi to the World: International Roadshows Meet Unprecedented Demand\n\nIn its efforts to continue expanding its international positioning, ADGM conducted a series of roadshows in the first half of 2024, covering multiple countries and regions including the USA, Europe, Hong Kong and the Chinese subcontinent.\n\nIn the USA, ADGM engaged in over 40 bilateral discussions with hedge funds, private equity funds, and venture capital firms at the iConnections Global Alts 2024. In Europe, ADGM held over 100 bilateral discussions with senior leaders in the Private Banking, Wealth Management, Private Equity, VC and Hedge Fund sectors in France, Switzerland, and other European hubs. These engagements occurred amidst the surge of global wealth into the UAE and included participation in renowned international events such as the 2024 IIF European Summit in Paris and the JP Morgan Global Markets Conference.\n\nThe roadshow in China and Hong Kong concluded successfully, with strategic meetings involving 75 entities. Discussions focused on cross-border regulatory cooperation with the Hong Kong Monetary Authority, expansion plans for several Hong Kong and Chinese firms in Abu Dhabi, and the enhancement of liquidity strategies in both regions. The engagement also featured the ADIO-organised Shanghai Investment Summit, where the announcement of a new trade forum – ‘The UAE-China Summit presented by HSBC’ - was announced. This summit is set to be a sub-event of the upcoming Abu Dhabi Finance Week (ADFW) in December.\n\nLeading the Path for Sustainable Finance and ESG in the Region\n\nFollowing the introduction of the region’s first comprehensive Sustainable Finance framework in 2023, the Registration Authority (RA) and the Financial Services Regulatory Authority (FSRA) of ADGM have proposed enhancements to these regulations. A discussion paper published in May 2024 invited input from industry experts including fund managers, asset managers and companies subject to the Companies Regulations 2020. These proposed enhancements provide greater clarity around the FSRA's requirements for ESG-labelled investment products that pursue broader sustainability objectives than only environmental. It also fosters demand for \"green\" products and services by aiming to provide investors with confidence that the risk of greenwashing has been addressed. Additionally, the consultation paper invites discussions around ADGM’s role in encouraging ADGM-based entities to identify and address climate-related risks to their businesses and develop their net-zero transition plans that support the UAE’s Net Zero by 2050 Strategic Initiative.\n\nThe RA of ADGM has also taken several initiatives in its efforts towards promoting best practices in ESG in the first six months of 2024. It has successfully launched the ESG Disclosures Framework micropage as well as an ESG Questionnaire Survey to understand the preparedness of ADGM-licensed entities for the framework.\n\nADGM at the Forefront of Blockchain Innovation\n\nFollowing the introduction of the Distributed Ledger Technology (DLT) Foundations Regulations, ADGM has signed strategic partnerships with a couple of organisations in 2024.\n\nThe first one was with the Solana Foundation, a non-profit organisation dedicated to decentralisation, adoption, and security on the Solana network to enhance DLT solutions and advance blockchain innovation. Another Memorandum of Understanding (MoU) was signed between ADGM and Hacken, a global leader in blockchain security auditing to collaboratively set new benchmarks for blockchain security and compliance as well as on-chain monitoring solutions in relation to ADGM’s DLT Foundations framework, positioning both organisations at the forefront of fostering a secure blockchain ecosystem.\n\nThese initiatives align with ADGM’s strategic vision of becoming a central hub for technology-driven financial services.\n\nADGM’s Workforce Booms Amid Abu Dhabi’s Growing Appeal with more than 2,500 New Jobs\n\nSustained investments across various sectors in Abu Dhabi have led to a strong performance in the Global Liveability Index 2024 published by the Economist Intelligence Unit. Abu Dhabi is the highest-ranked city in the MENA region, This ranking highlights Abu Dhabi’s strengths in factors such as stability, infrastructure and education.\n\nADGM is further enhancing its attractiveness as a preferred destination for professionals and investors alike. The workforce within ADGM’s Al Maryah Island has increased by more than 2,500 individuals, compared to the end of June 2023, and are now part of ADGM’s vibrant community.\n\nFurthermore, the workforce number is expected to maintain strong growth in 2024 in line with the positive responses received from a comprehensive outlook survey conducted in the first half. A total of 70.81% of companies anticipate expanding their workforce in ADGM during 2024, with 29.93% expecting significant increases and 40.88% planning moderate growth in staffing.\n\nADGM’s Al Reem Island Expansion Fuels a Residential Surge\n\nSince the announcement of the expansion in April 2023, Al Reem Island has seen the introduction of 1,266 new residential units, bringing the total to 21,335 units. The growth in occupancy rates has remained steady, rising from 84.78% in March 2023 to 92.82% by the end of June 2024. Moreover, with ADGM’s exceptional growth, many employees of the new companies established within ADGM’s jurisdiction are choosing Al Reem Island as their place of residence. ADGM's jurisdiction over both Al Maryah and Al Reem Island highlights its exceptional qualities, making it an ideal location to live, work, and conduct business.\n\nADGM Pioneers Seamless Business Migration in Al Reem Island\n\nThe first half of 2024 marks a significant phase in ADGM’s Al Reem Island transition post-expansion and brings forward various factors that are facilitating this process. Several initiatives, along with periodic awareness activities, have been conducted. A recent initiative includes revisions to ADGM’s licensing fee schedule, aligning with the transitional arrangements to Al Reem Island. Major reductions of 50 per cent and more to obtaining non-financial and retail licences within ADGM’s jurisdiction will take effect from 1st January 2025.\n\nIn addition to regulatory amendments supporting existing Al Reem Island businesses, ADGM has launched an information centre in Shams Boutik Mall and organised two community events in 2024, one in March and another in July. These initiatives were implemented to engage with the Al Reem Island business community, provide essential updates on licensing, registration fees, and transition processes as well as foster interactive dialogue and collaboration among stakeholders. ADGM also introduced an incentive initiative for existing non-financial and retail businesses on Al Reem Island, exempting them from paying any fees for obtaining an ADGM commercial licence providing they apply before 31st October 2024.\n\nThese initiatives are ensuring a seamless transition for Al Reem Island businesses and have been well received by the business community.\n\nADGM Academy’s Initiatives Paving Career Paths for 1020 Emiratis in H1 2024\n\nThe knowledge arm of the IFC, ADGM Academy (ADGMA), has been strategically contributing towards the UAE’s National Agenda by partnering with leading players from various sectors. Since its inception, ADGMA has achieved 98% employment placement of 3629 Emirati Nationals within the Private Sector through its National Development Agenda.\n\nIn the first half of 2024, ADGMA strategic collaborations and initiatives have supported the training and placement of 1020 Emirati nationals in professional job profiles across various companies in the UAE. Moreover, ADGMA signed numerous regional and international Memorandums of Understanding (MoU), to establish strategic partnerships and focus on developing Abu Dhabi’s knowledge economy. Some of the recent important collaborations signed by ADGMA at a federal level for the advancement of financial literacy include an MoU with the Emirates Foundation in the presence of H.H. Shaikh Theyab bin Mohamed bin Zayed, and an MoU with the GPSSA targeting the training of 10,000 current and soon-to-retire Federal employees across the UAE.\n\nSince its launch in 2023, ADGMA’s Research Centre has been marching ahead by conducting strategic research and successfully published four groundbreaking articles covering the areas of Fintech, Digital Transformation, Quantum Computing and AI in the first half of 2024.\n\n download Arabic",
      "tags": [
        "abu dhabi’s",
        "al reem island",
        "the first half",
        "uae",
        "abu dhabi"
      ],
      "url": "https://www.adgm.com/media/announcements/adgm-continues-rapid-growth"
    },
    {
      "title": "Celebrating 40 Years of Bilateral Cooperation: UAE-China Summit presented by HSBC Announced During ADGM's China Roadshow",
      "date": "07/08/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nCelebrating 40 Years of Bilateral Cooperation: UAE-China Summit presented by HSBC Announced During ADGM's China Roadshow\nADGM 07/08/2024\nThe plans for the ‘UAE-China Summit,’ presented by HSBC’, which is set to be a part of the upcoming ADFW in December, were unveiled during a series of more than 75 engagements with leading entities in Shanghai & Hong Kong.\nBilateral discussions during the roadshow will lead to cross-border regulatory cooperation with the Hong Kong Monetary Authority, expansion plans for several Hong Kong and Chinese firms in Abu Dhabi and the enhancement of liquidity strategies in each other's capital markets.\nSignificant Chinese financial institutions are at a stage of advanced exploration to establish within ADGM.\n\nIn its ongoing commitment to bolster Abu Dhabi’s global position and bilateral relations, ADGM, the international financial centre of the UAE capital, recently concluded a series of high-level engagements in China and participated in the Shanghai Investment Summit, organised by the Abu Dhabi Investment Office (ADIO) and attended by 200 industry and financial executives from China and Hong Kong.\n\nThe roadshow covered Shanghai and Hong Kong, featuring the announcement of a new trade forum – ‘The UAE-China Summit presented by HSBC’, slated to be one of the sub-events of the upcoming edition of Abu Dhabi Finance Week (ADFW) in December.\n\n\"The UAE-China Summit presented by HSBC’\" will mark 40 years of diplomatic relations between the UAE and China, which aim to explore bilateral trade and investment opportunities further and drive the cultural exchange between both countries.\n\nThe series of roadshows, initially planned for three days, were extended to five days to accommodate the unprecedented demand for bilateral meetings and discussions. These meetings aimed to showcase Abu Dhabi’s economic opportunities and investment potential as the ‘Capital of Capital,’ and ADGM’s value proposition as the region's fastest-growing international financial centre.\n\nOver 75 major financial institutions, including private equity firms, hedge funds, asset managers and family offices from Hong Kong and China actively engaged in strategic discussions with ADGM’s Leadership, including representatives from the Financial Services Regulatory Authority (FSRA) of ADGM and other key ADGM executives. Discussions spanned cross-border regulatory cooperation with the Hong Kong Monetary Authority, expansion plans in Abu Dhabi for various Hong Kong and Chinese firms, and strategies to enhance liquidity in each other's capital markets.\n\nArvind Ramamurthy, Chief of Market Development at ADGM said, \"The enthusiastic response we received during the China and Hong Kong roadshows underscores Abu Dhabi’s growing international recognition. Along with ADGM, ADFW has been playing a pivotal role in carrying Abu Dhabi’s ‘Falcon Economy’ across global borders. The demand in the Chinese subcontinent is unprecedented, and both Abu Dhabi and ADGM are ready to embrace these opportunities, further strengthening the 40-year diplomatic relations between our strategically important nations.\"\n\nMohamed Al Marzooqi, Chief Executive Officer, UAE, HSBC Bank Middle East said: “Over the last decade, bilateral investment between the UAE and China has reached billions of dollars, with the UAE's non-oil trade with China reaching USD81 billion in 2023. As Abu Dhabi’s multi-year transformation plans accelerate and China’s pro-business policies bolster its status as a giant in international trade, and a global leader in renewables, we foresee a surge in both inbound and outbound business opportunities along the corridor. Our long-standing presence in both countries, extensive expertise and international network position us well to support businesses and institutions seeking to capture investment and financial flows along these two dynamic markets.”\n\nIn addition to finance, other prominent sectors such as healthcare, infrastructure, and construction acknowledged the exponential growth opportunities within Abu Dhabi. Companies in these sectors expressed strategic plans to expand their business operations in the emirate, with several firms already confirming their expansion plans into Abu Dhabi’s international financial centre.\n\n download Arabic",
      "tags": [
        "hong kong",
        "china",
        "abu dhabi",
        "hsbc",
        "abu dhabi’s"
      ],
      "url": "https://www.adgm.com/media/announcements/uae-china-summit-presented-by-hsbc"
    },
    {
      "title": "Trustin Secures Key ADGM FSP Licence, Launches UAE & Middle East’s First Regulated Digital Escrow Platform",
      "date": "06/08/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nTrustin Secures Key ADGM FSP Licence, Launches UAE & Middle East’s First Regulated Digital Escrow Platform\nADGM 06/08/2024\nDisclaimer\nThis is an external communication and is not an official statement or announcement from ADGM.\n\nTrustin Limited, UAE Built First Digital Escrow Platform in the region pleased to announce an important milestone in their journey. They have secured Financial Service Permission (FSP) from the Abu Dhabi Global Market (ADGM) Financial Services Regulatory Authority (FSRA). This Licence is a significant milestone, solidifying its commitment to regulatory compliance and innovation in Escrow Services space.\n\nSecuring the FSP positions Trustin as first of its kind Digital Escrow Platform in the UAE and the region and will act as trusted partner for institutions and retail clients for safeguarding their buying and selling of goods & services.\n\nTrustin aims to democratize and simplify escrow services, making them accessible through a convenient, digital platform. This solution eliminates the time-consuming nature of traditional escrow banking.\n\nTrustin operates within the regulatory regime of FSRA and offers real-time transparency and security for all parties involved, potentially leading to a smoother and more cost-effective transaction experience for consumers, small businesses, and enterprises. All the parties involved in the transaction are subject to highest level of Know Your Customer / Know Your Business process to ensure compliance adherence. Trustin provides enhanced protection and trust for business transactions, and financial dealings, making it a preferred choice for end users seeking reliable and transparent escrow solutions.\n\nMomeen Ahmad, Co-Founder and SEO of Trustin Limited said, “We are pleased to announce this important milestone for Trustin Limited. With our final regulatory approval from FSRA, ADGM, we aim to create a safe and transparent digital ecosystem for buying, selling, and payments for retail and corporates in the economy. Trustin will act as a regulated neutral party to facilitate complete trade transactions from origination to conclusion by all the parties involved. We thank the FSRA, and ADGM for their support and guidelines in achieving our regulatory milestone”.\n\nTrustin addresses a major problem statement, which is the risk associated with open trade, particularly among SMEs and the retail market segment. These transactions often lack the security of traditional banking instruments like Letters of Credit (LC) and Bank Guarantees. Additionally, they can suffer from a lack of legal framework, transparency, and safety regarding payments and delivery of goods and services. Trustin's digital escrow services provide enhanced security, compliance, and transparency, ensuring safe and efficient transactions for SMEs and retail businesses. With Trustin, businesses can mitigate risks and build trust in their trade activities.\n\nParvez Akram Siddiqui, Co-Founder & CTO of Trustin Limited, said, “We are happy to witness the successful launch of Trustintrade.ae as the region's first locally built digital escrow services platform. The Platform is fully built in-house on cutting-edge technology and hosted on AWS, UAE to ensure data protection guidelines. The seamless integration with one of the largest banks in UAE, regulated by Central Bank of the UAE, safeguards the client's money in a separate client money account.\n\n download Arabic",
      "tags": [
        "trustin limited",
        "fsra",
        "uae",
        "trustin secures key",
        "launches uae & middle east"
      ],
      "url": "https://www.adgm.com/media/announcements/trustin-secures-key-adgm-fsp-licence"
    },
    {
      "title": "The Registration Authority of ADGM publishes a Consultation Paper on Employment Regulations",
      "date": "26/07/2024",
      "source": "ADGM RA",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nThe Registration Authority of ADGM publishes a Consultation Paper on Employment Regulations\nADGM RA 26/07/2024\n\nThe Registration Authority (RA) of ADGM has issued a Consultation Paper to explain and seek public feedback on proposed amendments to the Employment Regulations 2019.\n\nThe amendments enhance the Employment Regulations 2019 to reflect global changes in work practices, and to also provide greater clarity to employees and employers with respect to their rights and obligations.\n\nThis Consultation Paper is of interest to all ADGM-licensed employers and individuals employed or engaged by such employers (or those seeking to be employed or engaged by such employers) and their legal advisors.\n\nThe key features of the RA’s proposals are as follows:\n\nAmending the definition of ‘employee’ to enable employers to hire remote employees and to allow for more flexible working arrangements.\nClarifying ambiguities related to employee entitlements, including part-time employees.\nExpanding the list of employees’ duties to their employer, as well as expanding certain obligations employers have towards their employees.\nClarifying certain requirements regarding obtaining and cancelling an employee’s work permit and visa.\nExpanding obligations and responsibilities related to discrimination and victimisation in the workplace.\n\nTo view the Consultation Paper, please click here:\nConsultation Paper No. 6 of 2024 – Employment Regulations.\n\nThe consultation period will close on 26th August 2024.\n\n download Arabic",
      "tags": [
        "the registration authority",
        "a consultation paper",
        "the registration authority of adgm",
        "ra",
        "the employment regulations"
      ],
      "url": "https://www.adgm.com/media/announcements/the-ra-of-adgm-publishes-a-consultation-paper-on-employment-regulations"
    },
    {
      "title": "ADGM Continues Efforts to Ensure a Seamless Transition for Al Reem Businesses with Second Community Event",
      "date": "18/07/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nADGM Continues Efforts to Ensure a Seamless Transition for Al Reem Businesses with Second Community Event\nADGM 18/07/2024\nThis event builds on ADGM’s ongoing efforts to engage with the business community on the island, ensuring a seamless transition following its jurisdiction expansion.\nOver 150 representatives from the Al Reem Island business community attended the event.\n\nFollowing the success of its inaugural event, ADGM, the international financial centre, hosted its second Al Reem Island Business Community Event. This event underscores ADGM's ongoing commitment to engaging with local businesses and supporting their transition under its jurisdiction, with the deadline approaching by the end of the year.\n\nAttended by over 150 representatives from Al Reem Island's business community, the event provided essential updates on licensing, registration fees, and transition processes. It fostered interactive dialogue and collaboration among stakeholders.\n\nAs the deadline approaches for Al Reem Island businesses to transition to ADGM’s jurisdiction, ADGM’s executives shared valuable information on converting an ADDED licence to an ADGM licence. Additionally, the ADGM Registration Authority announced significant fee reductions for obtaining commercial licences, with reductions, exceeding 50 per cent for non-financial and retail licences within ADGM’s jurisdiction, that will take effect from 01 January 2025, aiming to stimulate growth within the financial centre.\n\nHamad Sayah Al Mazrouei, CEO of ADGM Registration Authority said, \"As advocates for the business community, we are committed to ensuring that businesses are well-informed about the ongoing transition and its impact on their operations. These events serve as a platform to guide and support Al Reem-based companies, fostering a conducive business environment in the emirate. Integrating Al Reem Island businesses smoothly into ADGM’s ecosystem is a key priority for us, reflecting our dedication to nurturing a supportive and business-friendly environment in Abu Dhabi, the Capital of Capital. These efforts align with and contribute significantly to the sustainable growth and development of the economy.”\n\nThe integration of Al Reem Island into ADGM marks a transformative chapter, solidifying its position as a leading international financial hub and a preferred global destination. Since the expansion, ADGM has supported the community by establishing an information centre at Shams Boutik Mall and additional centres in business towers on Al Reem Island, enhancing direct engagement and crucial support for the local business community. Furthermore, earlier this year, ADGM announced an incentive initiative exempting existing businesses on Al Reem Island from fees for obtaining an ADGM commercial licence until 31st October 2024.\n\nWith all regulatory, administrative, and logistical transitional arrangements in place and actively being implemented, ADGM continues to address key inquiries concerning the impact and outcomes of its jurisdiction expansion.\n\nFor further information on Al Reem Island’s transitional arrangements, you can contact alreem@adgm.com.\n\n download Arabic",
      "tags": [
        "al reem island",
        "a seamless transition",
        "the adgm registration authority",
        "hamad sayah al mazrouei",
        "adgm registration authority"
      ],
      "url": "https://www.adgm.com/media/announcements/adgm-to-ensure-a-seamless-transition-for-al-reem-businesses-with-second-community-event"
    },
    {
      "title": "ADGM Announces Fee Revision for Commercial Licences Starting 2025",
      "date": "17/07/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nADGM Announces Fee Revision for Commercial Licences Starting 2025\nADGM 17/07/2024\nADGM introduces another initiative in line with its efforts to support the seamless transition of Al Reem businesses to ADGM following its expansion to Al Reem Island last year.\nFee revision applies to all categories of licenses and will be applicable from 1st January 2025.\n\nADGM, the international financial centre of the UAE’s capital, has announced significant revisions to its licensing fee schedule as part of its transitional arrangements for Al Reem Island businesses. Starting from 1st January 2025, ADGM will implement major reductions of 50% or more for obtaining non-financial and retail licences within its jurisdiction. This initiative aims to enhance ADGM's business ecosystem, making it more attractive and accessible for various enterprises.\n\nUnder the revised fee schedule, new registrations within the non-financial category of businesses will see fees reduced from USD 10,000 to USD 5,000. In contrast, the annual licence renewal fees for the same category will decrease from USD 8,000 to USD 5,000. Fees for the retail category have also been significantly reduced, with new registration fees cut by two-thirds from USD 6,000 to USD 2,000. Licence renewals for the retail category will also see a 50% reduction, bringing the annual renewal fees down to USD 2,000.\n\nThe effective date of the revised licensing fees has been set as 1st January 2025 to align with the expiry of the current transition period, which ends on 31st December 2024. The new fee structure will be applicable across ADGM’s jurisdiction, which includes both Al Maryah and Al Reem Island.\n\nThe introduction of these fee revisions is in line with the series of consultations conducted in 2023 by ADGM with a focus group of Al Reem Island businesses to gather feedback and insights related to ADGM’s jurisdiction expansion. These discussions covered major topics such as the ease of obtaining an ADGM commercial licence and the relevant fees. Following these consultations, the Registration Authority (RA) of ADGM conducted a comprehensive review of its fee structure to meet the expectations of its newly expanded jurisdiction and commercial landscape, ensuring a smooth transition for its new business segments.\n\nHamad Sayah Al Mazrouei, the CEO of ADGM RA said, “To facilitate a seamless transition, ADGM and its Registration Authority have proactively introduced various initiatives, prioritising our business community at the core of every decision. We assessed the financial impact on different business categories and previously implemented a fee waiver for qualifying non-financial and retail businesses on Al Reem Island. Building on these efforts, we have now revised our fee structure to include significant reductions for the same categories starting next year. Our aim is to minimise potential disruptions for businesses transitioning to an ADGM licence, enabling them to operate efficiently within our jurisdiction.”\n\nThe cut-off date for the previously introduced fee exemption for qualifying non-financial and retail businesses located on Al Reem Island is 31st October 2024. Fee revisions for other categories include changes in the fee structure within the financial category, increasing from USD 15,000 to USD 20,000 and renewals rising from USD 13,000 to USD 15,000 for an annual ADGM licence. Additionally, there is a minor adjustment for tech and fintech startups, with fees changing from USD 1,000 to USD 1,500 for both new and existing licence renewals. The fees for the Special Purpose Vehicle (SPV) category remain unchanged at USD 1,900.\n\nThe full fee schedule that will be applicable for new business registrations as well as licence renewals from 1st January 2025, will be published in December.\n\n download Arabic",
      "tags": [
        "al reem island",
        "1st january",
        "the registration authority",
        "ra",
        "hamad sayah al mazrouei"
      ],
      "url": "https://www.adgm.com/media/announcements/adgm-announces-fee-revision-for-commercial--licences-starting-2025"
    },
    {
      "title": "ADGM Publishes its Whistleblowing Framework",
      "date": "10/07/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nADGM Publishes its Whistleblowing Framework\nADGM 10/07/2024\n\nADGM’s commitment to transparency, accountability and market integrity has been strongly reflected through its coordinated efforts to sustain these pillars.\n\nADGM, the international financial centre of the UAE’s capital, today announced the publication of its whistleblowing framework, a coordinated initiative between ADGM Authorities to sustain transparency, accountability and market integrity within the centre. The framework which is part of ADGM’s progressive business environment complements its existing regulatory frameworks and encompasses:\n\nDedicated regulations that recognise and protect good faith reporting of ‘protected disclosures’.\nAvailability of internal and external channels for reporting reasonably suspected breaches of ADGM legislation or financial crime.\nProtection for anonymous reporting in good faith of reasonably suspected misconduct.\nNon-retaliation protections integrated into existing employment regulations to guard employees of all ADGM entities against retaliation for speaking up.\nGood governance requirements to support whistleblowing for all ADGM entities.\nWritten policies and procedures for firms licenced by the FSRA, designated non-financial businesses or professions (DNFBPs) and large ADGM entities.\n\nThe endeavours of ADGM market participants to operate in line with the highest global standards of business practice are also reflected strongly within the framework. Entities within the centre will implement proportionate arrangements to support effective whistleblowing by 31st May 2025. These arrangements need to be captured in writing by companies that are over a certain size or that carry additional financial crime risks.\n\nThe whistleblowing framework provides a solid foundation that ADGM continuously builds upon and strengthen, ensuring the highest international business standards are upheld.\n\nPlease click here for the Whistleblower Protection Regulations 2024 and regulatory amendments, and Rules:\n\nFSRA Rules (Whistleblowing)\nAmendments to Legislation (Whistleblowing)\n download Arabic",
      "tags": [
        "the whistleblower protection regulations",
        "transparency, accountability and market integrity",
        "the centre",
        "the framework",
        "all adgm entities"
      ],
      "url": "https://www.adgm.com/media/announcements/adgm-publishes-its-whistleblowing-framework"
    },
    {
      "title": "AXA IM Alts expands its global presence with the opening of its first office in the Middle East",
      "date": "01/07/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nAXA IM Alts expands its global presence with the opening of its first office in the Middle East\nADGM 01/07/2024\nDisclaimer\nThis is an external communication and is not an official statement or announcement from ADGM.\nLocated at Abu Dhabi Global Market (ADGM), the new office enhances AXA IM Alts’ capital raising and client servicing capabilities in the region\nAmmar Bukhamsin appointed to lead the local office and Co-head MENA Client Group alongside newly promoted François Boissin\n\nAXA IM Alts, a global leader in alternative investments with US$ 200 billion (€184 billion) of assets under management, has expanded its global network with the opening of its first office in the Middle East. AXA IM Alts has been granted its financial services permission from the Financial Services Regulatory Authority (FSRA) to establish a category 4 license firm within ADGM.\n\nThe new office in Abu Dhabi’s international financial centre will be AXA IM Alts’ 16th globally and will be primarily focused on capital raising across AXA IM Alts’ private and alternative assets range, while enhancing client servicing through a dedicated local presence in the region. AXA IM Alts has appointed Ammar Bukhamsin as, and promoted François Boissin to, Co-Head of the MENA Client Group Alts. Additionally, Ammar Bukhamsin will serve as the Senior Executive Officer of AXA IM Middle East. Ammar and François will report directly to Florence Dard, Global Head of Client Group at AXA IM Alts.\n\nBefore joining AXA IM Alts, Ammar Bukhamsin previously spent over eight years at Natixis, including three years as the firm’s CEO for Saudi Arabia, during a 20-year career encompassing senior sales roles at Goldman Sachs, UBS and Citi. Ammar will be based in Abu Dhabi.\n\nFrançois Boissin has spent the past nine years within AXA, first as Vice President, Investor Relations for the AXA Group and then in capital raising at AXA IM Alts for the past two years, as part of a 20-year career in finance and sales. François will remain based in Paris.\n\nThe Middle East is home to a sophisticated investor base, including sovereign wealth funds, pension funds and global banks, demanding best-in-class and diversifying investment solutions. With the opening of this new office, AXA IM Alts brings its market-leading expertise in Real Estate (#1 real estate investment manager in Europe), Alternative Credit, Infrastructure, Natural Capital and Impact investing closer to institutional investors in the region and enhances client servicing through a dedicated local presence.\n\nIsabelle Scemama, Global Head of AXA IM Alts, commented: “The opening of our new office in Abu Dhabi marks a significant milestone in our expansion strategy and underscores the strategic importance of the Middle East in our international growth plans. This move marks a natural progression for our business in the region and paves the way for further successful partnerships with local investors to meet their rapidly evolving investment requirements, across AXA IM Alts’ expertise.”\n\nFlorence Dard, Global Head of Client Group at AXA IM Alts, added: “Having built strong relationships in the Middle East over a number of years, the opening of an office in Abu Dhabi is a natural step forward in our strategy to both grow our presence and accelerate our business development in the region. As a global leading alternative player, we have actively engaged with a large number of sophisticated Middle Eastern investors who seek attractive alternative investment opportunities, especially in Europe where we have a unique sourcing, access and breadth of offering.”\n\nArvind Ramamurthy, Chief of Market Development at ADGM said, “We congratulate and welcome AXA IM Alts on its recent expansion with a dedicated presence within ADGM, Abu Dhabi’s international financial centre. Abu Dhabi, also known as the 'Capital of Capital,' has become a premier destination due to its sophisticated regulatory regimes and abundant investment opportunities. As an anchored asset management firm, we look forward to the various expertise and innovative capabilities that AXA IM Alts will bring to ADGM’s vibrant ecosystem and to the region.”\n\n download Arabic",
      "tags": [
        "axa",
        "abu dhabi",
        "ammar bukhamsin",
        "the opening",
        "françois boissin"
      ],
      "url": "https://www.adgm.com/media/announcements/axa-im-alts-expands-its-first-office-in-the-middle-east"
    },
    {
      "title": "ADGM’s FSRA issues alert concerning fraudulent website - Sterwa Holdings",
      "date": "24/06/2024",
      "source": "ADGM FSRA",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nADGM’s FSRA issues alert concerning fraudulent website - Sterwa Holdings\nADGM FSRA 24/06/2024\n\nThe Financial Services Regulatory Authority (FSRA) of Abu Dhabi Global Market (ADGM) wishes to alert the financial services community and members of the public about the fraudulent nature and false claims made on the website at URL: https://sterwaholdings.com/index.html (the “Website”).\n\nIt has come to the FSRA’s attention that the Website falsely imitates the website of an entity that is regulated by the FSRA.\n\nThe FSRA is concerned that the Website may mislead potential investors and the public to believe that the Website belongs to an entity regulated by the FSRA.\n\nThe FSRA advises the public that the Website is not associated with an entity regulated by the FSRA and that the operators of the Website are not licensed or authorised to carry on Regulated Activities in or from the ADGM.\n\nThe FSRA believes that the Website has been created for the purpose of conducting fraud, by harvesting personal identifiable information and other credentials.\n\nFor information on how to report directly to the FSRA concerns in relation to potential fraudulent websites that purport to financial services in the ADGM, please refer to the FSRA’s Complaints Portal, which can be accessed here. For more information on how to report cybercrime to the relevant authorities, please refer to: Report cybercrimes online.\n\nOnly firms authorised by the FSRA can undertake Regulated Activities in the ADGM.\n\nTo determine if an entity has been granted a Financial Services Permission by the FSRA to carry on Regulated Activities in or from ADGM, you can search the FSRA’s Public Register.",
      "tags": [
        "fsra",
        "the website",
        "the fsra",
        "regulated activities",
        "an entity"
      ],
      "url": "https://www.adgm.com/media/announcements/adgms-fsra-issues-alert-concerning-fraudulent-website-sterwa-holdings"
    },
    {
      "title": "The Executive Centre (Tec) opens its second centre in Abu Dhabi Global Market (Adgm), Al Maryah Tower, expanding its presence in the Middle East",
      "date": "19/06/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nThe Executive Centre (Tec) opens its second centre in Abu Dhabi Global Market (Adgm), Al Maryah Tower, expanding its presence in the Middle East\nADGM 19/06/2024\nDisclaimer\nThis is an external communication and is not an official statement or announcement from ADGM.\n\nThe Executive Centre (TEC), Asia's largest premium flexible workspace provider, has announced the opening of a new centre at Level 7 of Al Maryah Tower at Abu Dhabi Global Market (ADGM), the international financial centre (IFC) of the capital city of the UAE and one of the most prestigious and dynamic business districts in the region. Backed by robust and resilient demand in one of the fastest-growing markets, the company is expanding its footprint in the region with the addition of over 17,500 sq.ft. at an investment of AED 10,000,000.\n\nTEC's workspaces are designed to cater to the needs of businesses in the region, providing exceptional and customized solutions that address the evolving demands of the market. The new bespoke centre features 291 spacious workstations designed to provide premium ergonomic flexible workspaces, with an exclusive member lounge and cafe.\n\nTEC has established a strong presence in the United Arab Emirates (UAE), with multiple locations across Dubai and Abu Dhabi. In 2018, the company made its foray into the region with its first centre at the One Central, located in Dubai's Central Business District, at Dubai World Trade Centre (DWTC). In 2023, TEC enhanced its presence in the region with the launch of its first centre in Abu Dhabi, at Al Sila Towers in ADGM, now operating at 100% occupancy. With the addition of the new centre at Al Maryah Tower, the company now has a total of over 140,000 sq. ft. live in UAE, with an aim to add 60,000 sq. ft. of flexi workspace over the next few years.\n\nCommenting on this strategic announcement, Managing Director of UAE, Saudi Arabia, and North India, at TEC, Rajat Kapur, said, “Abu Dhabi's vibrant market is a beacon of opportunity, driving companies towards flexible workspaces for agility and growth. Our expansion in this dynamic landscape signifies confidence in its potential. Abu Dhabi Global Market offers an ideal nexus for our operations, with its thriving retail, F&B scene, and exceptional commercial real estate. Our journey here has been remarkable, with Al Sila Tower serving as a testament to our success at 100% occupancy. Now, as we unveil a new chapter at Al Maryah Tower, we're poised to elevate experiences and empower businesses in this thriving ecosystem.”\n\nADGM welcomed TEC expansion to Al Maryah Tower, a step that further showcase the business-friendly environment that ADGM offers by combining effective regulation with attractive incentives, for businesses and investors seeking stability, growth opportunities, access to capital, and access to regional and global markets.\n\nIn 2023, TEC expanded its footprint exponentially with an addition of 26 new Centres across its network globally, marking a total of over 200 centres across 34 cities. Driven by strong client demand, South Asia and the Middle East saw the most significant growth with 12 new Centre openings, effectively doubling TEC's footprint in the region since the pre-pandemic period. With its strong financial results and a proven business model, The Executive Centre is poised to maintain its leadership in the premium workspace sector as it celebrates 30 years of excellence this year.\n\n download Arabic",
      "tags": [
        "tec",
        "al maryah tower",
        "abu dhabi global market",
        "the executive centre",
        "the region"
      ],
      "url": "https://www.adgm.com/media/announcements/the-executive-centre-opens-its-second-centre-in-adgm"
    },
    {
      "title": "Laser Digital receives Financial Services Permission from ADGM’s Financial Services Regulatory Authority to provide services in both traditional and digital assets",
      "date": "19/06/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nLaser Digital receives Financial Services Permission from ADGM’s Financial Services Regulatory Authority to provide services in both traditional and digital assets\nADGM 19/06/2024\nDisclaimer\nThis is an external communication and is not an official statement or announcement from ADGM.\n\nLaser Digital (AD) Limited, is delighted to announce that the Financial Services Regulatory Authority of Abu Dhabi has approved the issuance of a Financial Services Permission (FSP), completing Laser Digital’s licencing process with Abu Dhabi Global Market (ADGM).\n\nThe licence grants Laser Digital the permission to provide broker-dealer services and asset/fund management services in and from ADGM, in relation to both virtual assets and traditional assets. Jez Mohideen leads Laser Digital’s UAE entity with Ramin Shayesteh as Head of Distribution.\n\nJez Mohideen, CEO of Laser Digital commented “Our team at Laser is delighted with this significant milestone, and we are eager to contribute responsibly to the virtual asset industry in the UAE. We have always been committed to upholding the highest standards of compliance and regulations at ADGM, and we look forward to contributing to ADGM’s ecosystem.”\n\nCommenting on Laser’s licence approval, Arvind Ramamurthy, Chief of Market Development at ADGM said; “We’re delighted to welcome Laser Digital as we expand our financial community to include partners such as Laser, whose offerings align with ADGM and the FSRA’s international best practices and progressive regulatory ecosystem.”\n\n download Arabic",
      "tags": [
        "laser digital",
        "jez mohideen",
        "digital",
        "financial services permission",
        "laser digital receives financial services permission"
      ],
      "url": "https://www.adgm.com/media/announcements/laser-digital-receives-financial-services-permission-from-adgm"
    },
    {
      "title": "The Registration Authority of ADGM publishes consultation paper on Single Family Offices and Company Charges",
      "date": "14/06/2024",
      "source": "ADGM RA",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nThe Registration Authority of ADGM publishes consultation paper on Single Family Offices and Company Charges\nADGM RA 14/06/2024\n\nThe Registration Authority (RA) of ADGM has issued a Consultation Paper to explain and to seek public feedback and comments on the proposed amendments to:\n\nthe Companies Regulations 2020,\nthe Commercial Licensing Regulations (Controlled Activities) Rules 2022, and\nthe Commercial Licensing Regulations (Conditions of Licence and Branch Registration) Rules 2023.\n\nThe amendments enhance the Single Family Office (“SFO”) regime, the Restricted Scope Company (“RSC”) regime, and company charge registration regime for continuing companies.\n\nThis Consultation Paper is of interest to single family offices, and those considering establishing single family offices. The Consultation Paper is also of interest to those that advise on, or are considering, company continuation into the ADGM.\n\nThe key features of the RA’s proposals are as follows:\n\nRemove inconsistencies under the CR2020 with respect to charges against companies continuing into the ADGM, whilst providing certainty to existing charge holders of continuing companies.\nWith respect to SFOs and RSCs\nprovide clarity as to what constitutes SFO activity in the ADGM;\nintroduce minimum requirements to ensure the SFO regime in the ADGM is not abused whilst at the same time ensuring SFOs provide benefit to the region; and\nclarify when an RSC application can be made.\n\nTo view the Consultation Paper, please click Consultation Paper No. 5 of 2024 – Single Family Offices and Company Charges.\n\nThe consultation period will close on 14th July 2024.",
      "tags": [
        "the registration authority",
        "single family offices",
        "the adgm",
        "sfo",
        "the registration authority of adgm"
      ],
      "url": "https://www.adgm.com/media/announcements/adgm-publishes-consultation-paper-on-single-family-offices-and-company-charges"
    },
    {
      "title": "Under the patronage of HH Sheikh Khaled bin Mohamed bin Zayed Al Nahyan ADFW to return in December 2024 under the theme ‘Welcome to the Capital of Capital’",
      "date": "13/06/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nUnder the patronage of HH Sheikh Khaled bin Mohamed bin Zayed Al Nahyan ADFW to return in December 2024 under the theme ‘Welcome to the Capital of Capital’\nADGM 13/06/2024\nThe strategic theme for the third edition of ADFW will explore the multiple facets contributing to Abu Dhabi’s position as the ‘Capital of Capital’ focussing on financial, human and technological elements.\nIn just two years, ADFW has established itself as one of the world’s fastest-growing series of finance and investment conferences to garner regional and international recognition.\nLast year's Abu Dhabi Finance Week saw 14 major financial institutions, managing a total of USD452 billion in assets, announce their plans to establish operations within ADGM, highlighting its growing global stature and Abu Dhabi's attractiveness for international finance.\nThe 2024 edition will host over 50 events within ADGM and is set to attract 18,000 participants on thematic days for Abu Dhabi’s Falcon Economy, Asset Management, Tech and Sustainability.\n\nUnder the patronage of His Highness Sheikh Khaled bin Mohamed bin Zayed Al Nahyan, the Crown Prince of Abu Dhabi, and Chairman of the Executive Council, Abu Dhabi Finance Week (ADFW), the flagship financial event of the MEASA region hosted by Abu Dhabi Global Market (ADGM), announced its third edition under the theme ‘Welcome to the Capital of Capital.’ The event will run from 9th December to 12th December 2024.\n\nThis year’s strategic theme will aim to unravel the key facets of Abu Dhabi’s strength and value proposition, covering the evolution and rise of its role as the region’s prominent financial hub and destination of choice for top international financial institutions.\n\nThe ADFW 2024 will also seek to explore the opportunities created when monetary capital is combined with top-tier human capital, technological capabilities and ground-breaking innovations that are emerging in science, technology, engineering, and creativity.\n\nAbu Dhabi’s position as a financial hub has garnered global recognition. The UAE capital is home to some of the world’s largest Sovereign Wealth Funds and many international financial institutions that have chosen ADGM as their regional gateway to grow and expand.\n\nThe UAE capital’s technological sector has witnessed a significant evolution in recent years, marked by a surge in innovative startups, strategic investments in emerging technologies like artificial intelligence and blockchain, and the establishment of tech-focused initiatives and ecosystems. This growth trajectory has positioned Abu Dhabi as a regional hub for technology-driven innovation and entrepreneurship, attracting talent and investment globally.\n\nThe third edition of ADFW will also examine how the UAE capital is leading the charge to blend these aspects to contribute to the future prosperity of the Falcon Economy of Abu Dhabi.\n\nCommenting on the launch of ADFW’s 2024 edition, His Excellency Ahmed Jasim Al Zaabi Chairman of ADDED and ADGM said: “Abu Dhabi is rapidly emerging as a regional and international hub for finance, technology, education, hospitality, healthcare, tourism, trade, industry, artificial intelligence, and other types of key economic activity, aligned with a vision that is prioritising a diversified and smart economy. Such impactful transformations, which stem from Abu Dhabi’s unique value proposition, foster a proactive mindset, a spirit of innovation and driven by some of the most capable and ambitious professionals. Abu Dhabi Finance Week 2024 will delve into these aspects. Including the significant role of AI, which are contributing equally to positioning Abu Dhabi as the rising falcon economy and the ‘Capital of capital’.”\n\nLast year’s ADFW achieved monumental success by hosting 18,000+ diverse and international attendees from the financial industry during its thematic days. Of this, 39% represented an international audience, with over 3,500 business leaders, senior financial leaders from top global financial firms, industry experts, policymakers, regulators, investors, and bankers.\n\nIn a significant development,14 major financial institutions, collectively managing $452 billion in assets, announced plans to establish operations within ADGM during the ADFW 2023, reaffirming ADGM's rising prominence as a global financial hub and enhancing Abu Dhabi's appeal as an international finance destination. Notable institutions such as JPMorgan Chase & Co. and Rothschild & Co. showcased confidence in Abu Dhabi's economic reforms. ADGM's allure, bolstered by its adoption of English common law, continues to attract esteemed global firms like GQG Partners and The Children’s Investment Fund (TCI). The positive momentum from Abu Dhabi Finance Week underscores ADGM's pivotal role in fostering economic growth in the region.\n\nADFW’s 2024 edition will be one of the year’s most significant investment and finance trade gatherings globally. The event aims to be even bigger and better than previous editions and deliver a platform that will continue to attract global firms to the Falcon economy of Abu Dhabi.\n\nFor more information please visit: www.abudhabifinanceweek.com\n\n download Arabic",
      "tags": [
        "abu dhabi",
        "adfw",
        "abu dhabi finance week",
        "abu dhabi’s",
        "khaled bin mohamed bin zayed al nahyan"
      ],
      "url": "https://www.adgm.com/media/announcements/adfw-to-return-in-december-2024-under-the-patronage-of-hh-sheikh-khaled"
    },
    {
      "title": "ADGM Academy and Ethara Sign an MoU to Develop Next-gen Emirati Talent",
      "date": "13/06/2024",
      "source": "ADGM Academy",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nADGM Academy and Ethara Sign an MoU to Develop Next-gen Emirati Talent\nADGM Academy 13/06/2024\n\nThe MoU will enable Ethara and ADGM Academy to collaborate and work towards establishing an educational hub that will provide training programmes, upskilling opportunities, and courses for developing competencies that meet the changing market demands.\n\nAbu Dhabi Global Market Academy (ADGMA), the knowledge arm of the international financial centre of Abu Dhabi, announced the signing Memorandum of Understandings (MoUs) with Ethara, the region’s leading live event management company and venue operator.\n\nThe strategic collaboration between the two parties will explore training and developing the next generation of Emirati talent within different job roles and upskilling existing competencies to meet the changing market demands.\n\nWorking together, ADGMA and Ethara will aim to establish an educational hub that will develop training programmes to meet the skill requirements for maintaining a highly effective workforce, as well as launch National Development Programmes that support the onboarding, development, and retention of Emirati talent within different job roles. Both entities will also collaborate with the National Development Program and Financial Job Centre to advance existing and upcoming Emirati talent with professional employability skills. To promote continuous learning within the organisation, the MoU will look to launch new courses for developing specific identified skill sets and competencies that are needed to augment these talents forward in their career growth journey.\n\nMansoor Jaffar, CEO ADGM Academy & Research Centre at ADGMA said: “At ADGM Academy, we are committed to fostering the growth and development of Emirati talent to meet the changing demands of the market. This partnership with Ethara is a reflection of the significant steps we are taking towards creating a dynamic educational hub that will not only upskill our workforce but also ensure that our national talent is equipped with the competencies needed to thrive in an ever-evolving professional environment. Together, we will build a strong foundation for continuous learning and professional development, driving innovation and excellence across industries.”\n\nAhmed Lari, Chief Corporate Services Officer at Ethara commented :“We are delighted to announce our collaboration with ADGM Academy, through which we aim to empower the next generation of industry leaders in the region. With a wealth of world-class, international expertise within our organisation, and through our operations in Abu Dhabi and Dubai, we are dedicated to playing our part in nurturing Emirati talent in the industry. We look forward to working closely with ADGMA to improve skills and competencies that will drive innovation and excellence in the UAE’s events and entertainment sector.\n\nA joint working group will be established with representatives from both ADGMA and Ethara to supervise the implementation of the provisions highlighted in the MoU while also overlooking decision-making in the identified fields of mutual cooperation.\n\n download Arabic",
      "tags": [
        "adgm academy",
        "ethara",
        "emirati",
        "ethara sign",
        "abu dhabi"
      ],
      "url": "https://www.adgm.com/media/announcements/adgm-academy-and-ethara-sign-an-mou-to-develop-next-gen-emirati-talent"
    },
    {
      "title": "ADGM and the Bermuda Monetary Authority Sign a Digital Assets Memorandum of Understanding",
      "date": "10/06/2024",
      "source": "ADGM FSRA",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nADGM and the Bermuda Monetary Authority Sign a Digital Assets Memorandum of Understanding\nADGM FSRA 10/06/2024\n\nThe Financial Services Regulatory Authority (FSRA) of ADGM and the Bermuda Monetary Authority (BMA) announced the signing of a joint Digital Assets Memorandum of Understanding (MoU).\n\nThe MoU creates a framework enabling the collaboration between the BMA and the FSRA to support the establishment of digital assets entities across their jurisdictions and ensure their effective supervision. This framework encompasses regulatory and supervisory cooperation, investigative assistance and capacity enhancement initiatives.\n\nThe BMA’s Chief Executive Officer, Craig Swan, stated: “The agreement with the FSRA marks a significant step in strengthening links between regulators, supporting innovation and enhancing capabilities and resources through international collaboration. This MoU leverages the stability and expertise of our markets to address the evolving needs of the digital asset business sector. We look forward to greater knowledge exchange and deeper regulatory cooperation to encourage a secure and sustainable growth environment.”\n\nEmmanuel Givanakis, CEO of the FSRA of ADGM said, “The signing of the MoU underlines our dedication to cooperation and the exchange of information between ADGM FSRA and BMA. Both jurisdictions share a mutual commitment to driving responsible innovation for the digital asset landscape. Through this agreement, we aim to foster the creation and effective oversight of digital asset businesses across both jurisdictions and pave the way for greater regulatory harmonization, enhanced integrity and efficiency as well as prudent industry growth.”\n\nThe MoU, which was entered into earlier this year with immediate effect, extends to further areas of cooperation including publications and media content, supervisory colleges, working groups and training.\n\n download Arabic",
      "tags": [
        "fsra",
        "the bermuda monetary authority sign",
        "bma",
        "the mou",
        "the fsra"
      ],
      "url": "https://www.adgm.com/media/announcements/adgm-and-the-bermuda-monetary-authority-sign-a-digital-assets-mou"
    },
    {
      "title": "Paxos International Introduces Lift Dollar (USDL) - the First Stablecoin to Offer Holders Daily Yield in Wallet Under Regulatory Oversight",
      "date": "07/06/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nPaxos International Introduces Lift Dollar (USDL) - the First Stablecoin to Offer Holders Daily Yield in Wallet Under Regulatory Oversight\nADGM 07/06/2024\nDisclaimer\nThis is an external communication and is not an official statement or announcement from ADGM.\nPaxos Encourages Broad Stablecoin Adoption & Industry Expansion with New Model where Holders Directly Benefit from Yield Earned on Reserves\nLaunch Follows Paxos’ Track Record of Leading Stablecoin Innovation for Financial Industry Leaders\n\nPaxos International, a UAE-based affiliate of Paxos, today announced the launch of a yield-bearing stablecoin – Lift Dollar (USDL). Issued by Paxos International, a regulated entity under the Financial Services Regulatory Authority (FSRA) of Abu Dhabi Global Market (ADGM), USDL will be available to consumers in eligible global markets. Paxos International will partner with global exchanges, wallets and platforms to distribute USDL to individuals and institutions.\n\nUSDL is unmatched in the market as holders earn overnight yield from short-term, high quality liquid US government securities and cash equivalent reserve assets held under the safe protection and custody requirements of the FSRA. This reserve structure is like other Paxos-issued US dollar stablecoins that are backed 1:1 in value. USDL is issued permissionlessly on Ethereum and pays yield programmatically on a daily basis to token holders, subject to the reserve assets fully backing the total value of USDL in circulation. USDL marks an important innovation in democratizing overnight yield by shifting interest earned on stablecoin reserve holdings directly to eligible end holders from the central issuer. This follows Paxos’s proven history of building blockchain solutions for financial institutions and industry leaders.\n\nUsing an Ethereum smart contract, USDL distributes the yield generated from its reserves to eligible wallet addresses daily without requiring any additional steps by the token holder. This results in a seamless experience for token holders as their USDL wallet holdings increase every day. Paxos will retain an issuer fee and pay out the remaining yield earned based on prevailing daily market conditions. Companies in permitted jurisdictions interested in enabling USDL on their platforms can onboard with Paxos International.\n\nCharles Cascarilla, Member of the Board of Directors of Paxos International, said: “Paxos is committed to revolutionizing the global financial markets through reliable, trusted and regulated blockchain offerings. The digital asset ecosystem has evolved to create mechanisms for token holders to earn yield on stablecoins, but these options are high-risk, opaque and have led to the failure of numerous firms. USDL is a first-of-its-kind—a regulated product, earning and paying safe yield on a daily basis. Until now, only centralized issuers have benefitted from the economics of stablecoin reserves. Paxos International has reimagined this dynamic so that all token holders can safely use and grow their regulated USD stablecoin holdings. Our vision is a more democratic, inclusive and accessible financial market. USDL is a pivotal step towards achieving that goal.”\n\nThe FSRA is recognized for its robust regulatory framework and commitment to fostering innovation in financial services. Under FSRA’s license, Paxos International is required to hold only high-quality liquid assets to back USDL - US dollar deposits, short duration US treasuries and cash equivalents. It is required to ensure that USDL will maintain 1:1 parity with the US dollar and consumers can redeem their tokens for fiat at all times.\n\nRonak Daya, Head of Product at Paxos, said: “Lift Dollar is the first stablecoin designed to benefit both end users and distributors in a safe manner. Through Paxos International, eligible users around the world can access USDL directly through secure channels managed by trusted partners and watch their holdings grow daily in their wallets. Paxos International leverages a technical mechanism called rebasing to seamlessly distribute yield to users’ wallets. We are excited for the opportunities this will create for businesses and individuals. We look forward to growing our partner network globally this year.”\n\nPaxos has a strong track record of building blockchain technology to power offerings for financial industry leaders. Its digital assets include PayPal USD (PYUSD), Pax Dollar (USDP) and Pax Gold (PAXG) regulated by the New York Department of Financial Services, each of which provides partners and users a quality, 1:1 asset parity overseen by the highest levels of regulatory oversight. The company is the trusted partner for enterprises around the world to tokenize, custody, trade and settle assets.\n\nArvind Ramamurthy, Chief of Market Development at ADGM, said, “ADGM extends congratulations to Paxos International on receiving approval to issue its yield-bearing stablecoin, Lift Dollar (USDL) to select global markets. This achievement underscores the industry's growth and innovation in the UAE and the wider region, made possible through FSRA's progressive and credible regulatory oversight. We anticipate the continued growth of USDL and eagerly await the innovative products that Paxos International will introduce in this ever-evolving and dynamic digital asset market.\"\n\n download Arabic",
      "tags": [
        "paxos international",
        "fsra",
        "lift dollar",
        "us",
        "paxos international introduces lift dollar"
      ],
      "url": "https://www.adgm.com/media/announcements/paxos-international-introduces-first-stablecoin-to-offer-holders-daily-yield-in-wallet"
    },
    {
      "title": "ADGM FSRA Issues Alert Over Misleading Claims Made by Manra Capital, an Unlicensed Firm",
      "date": "05/06/2024",
      "source": "ADGM FSRA",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nADGM FSRA Issues Alert Over Misleading Claims Made by Manra Capital, an Unlicensed Firm\nADGM FSRA 05/06/2024\n\nThe Financial Services Regulatory Authority (FSRA) of Abu Dhabi Global Market (ADGM) would like to alert the financial services community and members of the public, about misleading claims made by Manra Capital over the “Tharwa Fund” a purported fixed-return real estate fund.\n\nIt has come to the attention of the FSRA that Manra Capital falsely claimed in a brochure for a proposed marketing event that the Tharwa Fund was “overseen” and “supervised” by the ADGM FSRA.\n\nThese claims are false.\n\nThe FSRA advises the public that:\n\nManra Capital is not and has never been:\n\n- licensed by the FSRA to carry on any form of Regulated Activity in or from ADGM; and\n\n- incorporated in ADGM or licensed to undertake any form of commercial activities in ADGM; and\n\nThe Tharwa Fund is not and has never been established as a Collective Investment Fund in ADGM.\n\nOnly firms authorised by the FSRA can undertake Regulated Activities in ADGM.\n\nTo determine if an entity has been granted a Financial Services Permission by the FSRA to carry on Regulated Activities in or from ADGM, you can search in the FSRA’s Public Register.\n\nThe FSRA advises the financial services community and members of the public to exercise caution when contacted by any entity that purports to be licensed to undertake Regulated Activities in ADGM unless and until the entity's regulated status can be confirmed by checking the FSRA's Public Register.",
      "tags": [
        "manra capital",
        "fsra",
        "the fsra",
        "the tharwa fund",
        "regulated activities"
      ],
      "url": "https://www.adgm.com/media/announcements/adgm-fsra-issues-alert-over-misleading-claims-made-by-manra-capital-an-unlicensed-firm"
    },
    {
      "title": "ADGM Publishes a Consultation Paper on the Comprehensive Revamp of its Real Property Regulations",
      "date": "31/05/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nADGM Publishes a Consultation Paper on the Comprehensive Revamp of its Real Property Regulations\nADGM 31/05/2024\n\nAbu Dhabi Global Market (ADGM), the International Financial Centre of the UAE’s capital, has published a Consultation Paper to seek views on its proposals on the comprehensive revamp of its real property regulatory framework. This regulatory revamp addresses market needs and ensures we stay aligned with market developments, ultimately positioning ADGM Real Property regulation as best-in-class support the growth of the real estate sector.\n\nADGM seeks input on the following proposed amendments:\n\nAmendments to its Real Property Regulations 2015 focused on protections for tenants in short-term residential leases;\nIntroduction of a new framework for the registration of off-plan development projects, off-plan sales, and Project Accounts.\nIntroduction of a framework for registering off-plan and real property professionals, such as brokers, valuers and property managers, who provide services within ADGM’s jurisdiction.\n\nThis Consultation Paper is part of ADGM’s strategy to r engage with our stakeholders at every stage of our journey.\n\nTo view full details of the Consultation Paper, please click here.\n\nThe Consultation Paper is open for feedback until 19th June 2024.\n\n download Arabic",
      "tags": [
        "the comprehensive revamp",
        "a consultation paper",
        "the international financial centre",
        "project accounts",
        "the consultation paper"
      ],
      "url": "https://www.adgm.com/media/announcements/adgm-publishes-a-consultation-paper-on-the-comprehensive-revamp-of-its-real-property-regulations"
    },
    {
      "title": "ADGM Successfully Concludes a Series of Roadshows in the European Region",
      "date": "29/05/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nADGM Successfully Concludes a Series of Roadshows in the European Region\nADGM 29/05/2024\nRoadshows included engagements at various renowned international events such as the 2024 IIF European Summit held in Paris, JP Morgan Global Markets Conference and bilateral discussions.\nADGM Officials also conducted over 100 bilateral discussions with senior leaders in the Private Banking, Wealth Management, Private Equity, VC and Hedge Fund sectors in France, Switzerland, and other European hubs, amidst the surge of global wealth into the UAE.\n\nAbu Dhabi Global Market (ADGM), the international financial centre of the UAE’s capital, continues to expand its international positioning by conducting a series of roadshows across France and Switzerland. The roadshows included participating in over 100 bilateral discussions and engaging in significant international financial market events.\n\nThe strategic rationale behind these roadshows is to explain the growing value proposition of Abu Dhabi as an IFC to funds, and elite wealth clients looking to expand in the region and also lead the way for them to learn more about Abu Dhabi and ADGM’s well-rounded and progressive regulatory offerings, ensuring that Abu Dhabi continues to be the preferred destination for global wealth and asset management.\n\nThe 2024 IIF European Summit was held in Paris, France from 15th – 16th May, where ADGM was the supporting sponsor of this major event, which brought together hundreds of senior policymakers, regulators, and global financial services executives, working across banking, insurance, and asset management, for lively and interactive sessions. The event focussed on the topic ‘Leveraging Sustainable Finance for Growth, Innovation and the Net Zero Transition’. During this event, the CEO of the Financial Services Regulatory Authority (FSRA) of ADGM – Emmanuel Givanakis participated in a panel designed to gather insightful views from C-suites on ‘Charting the Course to Transition’ to highlight how transition planning is evolving in practice, and what do financial firms expect from regulators and policymakers in order to support a just and transparent transition.\n\nDuring its delegation visit to Switzerland, ADGM concluded a series of over 35 bilateral discussions with leading Private Banking & Wealth Management firms. These meetings were designed to explore opportunities for expansion to the UAE and to exchange insights on best practices for servicing elite clients, including the operation of family offices.\n\nCommenting on ADGM’s roadshows, Arvind Ramamurthy, Chief of Market Development at ADGM said, “As we grow, it is increasingly crucial for ADGM to respond to the high international demand for ADGM as a strategic location for growth. As we visit key international markets, we strengthen our global positioning, learn the key developments effecting our clients, and highlight the contributions that we are making as an international financial centre. These roadshows have provided platforms to showcase ADGM's dynamic ecosystem, progressive regulatory frameworks, and thriving business opportunities. Our engagements in Europe underscore ADGM's commitment to fostering global partnerships, driving innovation, and shaping the future of finance.”\n\nRamamurthy added, “By engaging with leading international firms and adopting global best practices, we aim to ensure that our offerings remain at the forefront of excellence and innovation. This is essential for maintaining Abu Dhabi’s position as a leading destination for asset and wealth management.”\n\n download Arabic",
      "tags": [
        "abu dhabi",
        "a series",
        "france",
        "switzerland",
        "uae"
      ],
      "url": "https://www.adgm.com/media/announcements/adgm-successfully-concludes-a-series-of-roadshows-in-the-european-region"
    },
    {
      "title": "24 French Asset Management Firms With $1.6 Trillion AUM Convene for Second UAE – France Investor Meetup",
      "date": "23/05/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\n24 French Asset Management Firms With $1.6 Trillion AUM Convene for Second UAE – France Investor Meetup\nADGM 23/05/2024\nOrganized by ADGM and the French Ministry of Economy, Finance and Industrial and Digital Sovereignty.\nFour major French asset management firms—Ardian, BNP Paribas, Tikehau Capital, and Eiffel Investment Group have offices in ADGM as part of their strategy to expand their global footprint.\nAimed at reinforcing investment ties between the two nations, forging strategic alliances, identifying new opportunities, and driving mutual economic growth.\n\nFollowing the resounding success of its inaugural edition, ADGM, the leading international financial centre of the UAE’s capital, hosted the second edition of the UAE-France Investors Meetup. This exclusive gathering, led by His Excellency Bruno Le Maire, the French Minister of Economy, Finance, and Industrial and Digital Sovereignty, is designed to foster partnerships between the two nations through dialogues on investment opportunities and areas of collaboration within UAE-French financial landscape.\n\nIn line with the UAE’s commitment to developing international cooperation through collaboration with partner countries, this meeting, held in the presence of His Excellency Khaldoon Khalifa Al Mubarak, Managing Director and Group Chief Executive Officer, Mubadala Investment Company, served as a vital platform for strengthening economic and financial ties between the UAE and France, building on long-standing bilateral strategic relations. In his opening remarks, His Excellency commented on the historic and broad economic ties, as foundations for France and the Emirates to significantly expand their investment ties across future industries and new value chains.\n\nThis year's event also witnessed active participation from the UAE and France, facilitating discussions on opportunities, exploring new avenues for collaboration in key sectors, and enhancing mutual understanding of both financial landscapes.\n\nCommenting on the successful event, His Excellency Ahmed Jasim Al Zaabi, Chairman of Abu Dhabi Department of Economic Development (ADDED), and Abu Dhabi Global Market (ADGM), said, “We welcome His Excellency Bruno Le Maire and the French delegation. The partnership between France and the UAE has strengthened over the years, with trade contributing to the growth and economic diversification of both nations. These meetups are crucial for discussing the evolution of economic systems and rethinking cross-border trade and investments. Abu Dhabi has played a pivotal role in facilitating these important dialogues, providing a platform for informed discussions and strategic partnerships. By hosting events like the annual Investor Meetup, we emphasize our commitment to fostering international cooperation and driving economic growth. We look forward to continuing our strong partnership with France and exploring new avenues for collaboration that will benefit both our countries.”\n\nBruno Le Maire, Minister of the Economy, Finance and Industrial and Digital Sovereignty, declared: “France and the United Arab Emirates have never ceased to strengthen their relationship. Today marks a new stage in the deepening of our economic and financial ties. The format of this meeting is a success: it enables us to diversify and broaden our cooperation, drawing on the diversity of each other's resources and capabilities to support the ambitions of our two countries.”\n\nBertrand Rambaud, Chairman of France Invest, said: “As the leading private capital industry in the EU, deepening our ties with the fast-growing financial ecosystem in Abu Dhabi is a key priority. The region offers a wide range of opportunities for GPs and portfolio companies. We were delighted to exchange with stakeholders and policymakers with the full support of French and Abu Dhabi authorities.”\n\nAdditionally, this year’s event reiterated a successful format, offering participants the opportunity to pre-select the best-performing French private equity funds for tailored 15-minute speed dating sessions. Through these bespoke encounters and informal meetings, attendees had the chance to engage directly with key executives, fostering meaningful connections and exploring potential avenues for collaboration.\n\nThe UAE-France Investors Meetup represented a unique opportunity for stakeholders in both countries to forge strategic alliances, identify new opportunities, and drive mutual growth. As the event returns to ADGM, it reaffirms Abu Dhabi’s position as a global financial hub and underscores the enduring strength of the Franco-Emirati partnership.\n\nAlong with the French minister, the French delegation to Abu Dhabi included high level representatives from top-tier French asset management companies.\n\n download Arabic",
      "tags": [
        "abu dhabi",
        "france",
        "uae",
        "the uae-france investors meetup",
        "the uae"
      ],
      "url": "https://www.adgm.com/media/announcements/24-french-asset-management-firms-convene-for-second-uae-france-investor-meetup"
    },
    {
      "title": "Klickl Secures Financial Services Permission to Enhance Web3.0 Offerings Globally for SMEs",
      "date": "23/05/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nKlickl Secures Financial Services Permission to Enhance Web3.0 Offerings Globally for SMEs\nADGM 23/05/2024\nDisclaimer\nThis is an external communication and is not an official statement or announcement from ADGM.\n\nKlickl is proud to announce its recent acquisition of a Financial Services Permission (FSP) from the Financial Services Regulatory Authority (FSRA) of Abu Dhabi Global Market (ADGM). This milestone not only enhances Klickl's ability to offer both custody and brokerage services for virtual assets as a principal or agent but also marks a significant step in its strategy to bridge regional expertise with global web 3.0 market demands.\n\nSince its inception, Klickl has emerged as a leader in web3.0 financial services within the Middle East, committed to global standards and the growth of a sustainable cryptocurrency ecosystem. With this new permission, Klickl is set to expand its innovative financial solutions, particularly through its Digibox products as DeFin（Decentralized Financial Infrastructure Network）, to small and medium-sized enterprises (SMEs) globally, providing them with unparalleled competitive advantages in the evolving Web3.0 landscape.\n\nMichael Zhao, CEO of Klickl, stated, \"Abu Dhabi is at the forefront of financial innovation, and our integration into the UAE’s regulated cryptocurrency landscape is a testament to our robust strategy. We are grateful for the FSRA's endorsement, which propels us forward in our mission to reshape financial infrastructures worldwide.\"\n\nArvind Ramamurthy, Chief of Market Development at ADGM said, “We extend our congratulations to Klickl on receiving an FSP from the FSRA of ADGM, enabling them access to ADGM’s cutting-edge virtual assets framework and infrastructure for broader regional service expansion. This milestone introduces Klickl to ADGM's dynamic cryptocurrency community, opening doors to opportunities to reach institutional investors and market users that align with their business objectives. ADGM stands as the region's premier and innovation-driven international financial center, and we look forward to Klickl’s growth in Abu Dhabi and beyond.\"\n\nWith a strong regional footprint and a vision for global impact, Klickl is also excited to launch further initiatives in the coming months to broaden its suite of digital financial services.\n\nLooking ahead, Zhao shared his vision for the company’s future: \"Klickl is eager to develop further innovative products and services within the regulatory framework, creating a seamless bridge between digital and traditional financial sectors. Our goal is to provide universal access to the cryptocurrency world, supporting not only Abu Dhabi’s ambition to become a premier global digital asset financial hub but also empowering SMEs worldwide with cutting-edge financial tools.\"\n\nFor more information on how Klickl is revolutionizing digital finance and to explore the possibilities with Digibox, visit www.klickl.com.\n\n download Arabic",
      "tags": [
        "klickl",
        "abu dhabi",
        "klickl secures financial services permission",
        "fsp",
        "the financial services regulatory authority"
      ],
      "url": "https://www.adgm.com/media/announcements/klickl-secures-financial-services-permission-to-enhance-web3-offerings-globally-for-smes"
    },
    {
      "title": "ADGM's Financial Regulator fines Sarwa Digital Wealth (Capital) Limited USD 122,500 for making an Offer of Securities in ADGM without Approved Prospectus",
      "date": "21/05/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nADGM's Financial Regulator fines Sarwa Digital Wealth (Capital) Limited USD 122,500 for making an Offer of Securities in ADGM without Approved Prospectus\nADGM 21/05/2024\n\nThe Financial Services Regulatory Authority (FSRA) of Abu Dhabi Global Market (ADGM) has imposed a financial penalty of USD 122,500 (AED 449,881) on Sarwa Digital Wealth (Capital) Limited (Sarwa), an FSRA licensed firm in ADGM. The FSRA found that Sarwa contravened FSRA administered regulations by making an Offer of Securities in ADGM without an Approved Prospectus.\n\nThe FSRA has also imposed a Requirement on Sarwa to undertake an independent review of its governance arrangements.\n\nThe FSRA administered regulations prohibit the making of an Offer of Securities in ADGM without a prospectus, approved by the FSRA, that contains all information that an investor would reasonably require to make an informed decision in relation to the investment.\n\nAn FSRA Investigation found that Sarwa, in and around April and May 2023 offered an opportunity to invest in securities related to a number of shares of its parent entity to its network of clients and registered users of its application. It did this by:\n\ndistributing communications to a significant number of potential investors containing information on the terms of the offer and the securities offered, to enable investors to buy or subscribe to the offer;\nmaintaining a website publishing further information in relation to the offer; and\nengaging in further communication with potential investors to provide additional information and to facilitate subscriptions.\n\nSarwa did not provide an Approved Prospectus to potential investors. As a result, the potential investors to whom Sarwa made the offer were not provided with sufficient information to make an informed decision in relation to the investment.\n\n144 investors subscribed to the offer and committed approximately USD2.1 million.\n\nThe FSRA recognises Sarwa’s cooperation in relation to this matter, which included Sarwa reversing all committed subscriptions promptly upon being informed of the FSRA’s concerns.\n\nIn addition, Sarwa agreed to settle at the earliest opportunity and therefore qualified for a discount on the financial penalty. A further reduction was given in recognition of the Regulatory Action taken by the Dubai Financial Services Authority (DFSA).\n\nThe FSRA’s investigation was conducted in close coordination with the DFSA, which investigated a related licensed firm in the Dubai International Financial Centre. The DFSA and the FSRA amongst other things conducted joint interviews and shared intelligence, evidence and findings. The FSRA recognises the DFSA’s cooperation and assistance in this matter.\n\nEmmanuel Givanakis, Chief Executive Officer of the FSRA said, “This enforcement action demonstrates the FSRA’s robust regulatory approach to its regulatory framework, ensuring investor protection is of paramount importance and making sure all regulated entities maintain high standards of conduct. More importantly, this is also a matter that demonstrates the strong collaborative approach between UAE Regulators through cooperating and sharing information in parallel investigations, thereby safeguarding the UAE’s financial ecosystem and protecting its investors.”\n\nA copy of the FSRA’s Final Notice can be found on the ADGM website at URL: FSRA Regulatory Actions\n\n download Arabic",
      "tags": [
        "fsra",
        "the fsra",
        "sarwa",
        "sarwa digital wealth",
        "the offer"
      ],
      "url": "https://www.adgm.com/media/announcements/adgms-financial-regulator-fines-sarwa-digital-wealth-capital-limited"
    },
    {
      "title": "ADGM Publishes a Discussion Paper on Enhancements to its Sustainable Finance Regulatory Framework",
      "date": "20/05/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nADGM Publishes a Discussion Paper on Enhancements to its Sustainable Finance Regulatory Framework\nADGM 20/05/2024\n\nAbu Dhabi Global Market (ADGM), the International Financial Centre of the UAE’s capital, has today published a Discussion Paper to seek views on its proposals for the continued development of its regulatory framework for sustainable finance.\n\nADGM seeks input on its proposed guidance outlining the FSRA’s expectations for ESG-labelled investment vehicles and appropriate next steps in development of regulatory expectations pertaining to climate-related risk management and transition planning.\n\nThis discussion paper should be of particular interest to fund managers and asset managers, in relation to the proposed guidance; and all companies subject to the Companies Regulations 2020, in relation to development of ADGM’s expectations pertaining to climate-related risk management and transition planning.\n\nFor the Discussion Paper, please click here: Discussion Paper No. 1 of 2024 – Enhancing the Sustainable Finance Regulatory Framework for ADGM.\n\nThe Discussion Paper is open for feedback until 19 July 2024.",
      "tags": [
        "a discussion paper",
        "the international financial centre",
        "climate-related risk management",
        "transition planning",
        "the discussion paper"
      ],
      "url": "https://www.adgm.com/media/announcements/adgm-publishes-a-discussion-paper-on-enhancements-to-its-susfin-regulatory-framework"
    },
    {
      "title": "Abu Dhabi: The Capital of Capital Sees a Record of 211% Surge in AUM at ADGM since Q1 2023",
      "date": "20/05/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nAbu Dhabi: The Capital of Capital Sees a Record of 211% Surge in AUM at ADGM since Q1 2023\nADGM 20/05/2024\nAssets under management have increased by 211% from Q1 2023 to Q1 2024,\n107 asset and fund managers operating in ADGM, currently managing 137 funds.\nThe number of operational entities grew by 30%, and the workforce experienced a significant increase at the end of Q1 2024 compared to the same period last year.\n\nADGM, the international financial centre (IFC) of the UAE’s capital, continues its solid performance paving the way for another strong year as the fastest growing financial centre in the region, with a record-breaking start during the first quarter of 2024 marked by an increase of 211% in Assets Under Management (AUM) compared to the first quarter of the year 2023.\n\nThe growth trajectory of ADGM in Assets Under Management, coupled with a significant increase during Q1 2024 in the number of operational entities, the size of workforce and other elements of the IFC ecosystem, underscore the concerted efforts and strategic initiatives undertaken to strengthen its standing as a leading international financial centre, and reaffirms Abu Dhabi’s position as a global financial powerhouse and a destination of choice for regional and global entities.\n\nCommenting on ADGM’s continued growth and strong performance, H.E. Ahmed Jasim Al Zaabi, Chairman of ADGM said, “Abu Dhabi once again affirms its position as the leading financial powerhouse of the MEASA region. ADGM’s unwavering commitment to excellence, demonstrated through its initiatives and achievements, continues to drive remarkable growth, attracting talent, businesses, and quality investments from across the globe. This year holds the promise of even greater growth for ADGM and its ecosystem, marking a significant stride towards achieving Abu Dhabi’s economic goals and ambitions.”\n\nAbu Dhabi: The Region's Premier Financial Hub for Asset Management\n\nADGM's asset management sector began 2024 with vigour, witnessing an unprecedented influx of global asset managers establishing operations in the IFC, and pushing the surge in the size of Assets Under Management within ADGM during the first three months of the year 2024 to unprecedented figures reaching a growth of 211% compared to the same period of 2023. By the end of March 2024, the number of fund and asset managers operating in ADGM reached 107, managing 137 funds.\n\nThe attractiveness of ADGM as a holistic financial hub which stands as the sole jurisdiction in the region to adopt the direct application of English common law, has resulted in ongoing increase in the number and diversity of prominent regional and global firms establishing in ADGM. By the end of March 2024, the total number of operational entities in ADGM increased by 30% compared to the same period last year, to reach 1950 including 291 financial services entities.\n\nInternational roadshows to meet the interest in Abu Dhabi\n\nIn response to unprecedented demand from major global asset managers in the hedge fund, private equity, and venture capital sectors, ADGM has embarked during the first quarter of this year on a trade mission to multiple countries, starting with the United States where more than 40 bilateral discussions with hedge funds, private equity funds, and venture capital firms at the iConnections Global Alts 2024. This event is recognised as the largest gathering for alternative investment professionals, providing an unparalleled platform for networking, collaboration, and the exchange of insights within the alternative investment landscape.\n\nAbu Dhabi's Liveability Sparks ADGM's Workforce Surge\n\nADGM's workforce has grown to over 25 thousand individuals, working on Al Maryah Island, as more talented individuals choose Abu Dhabi as their destination to live, work, and thrive.\n\nAbu Dhabi's appeal extends beyond its business opportunities, it has been ranked as the best and safest city to live in the region offering a high quality of life with world-class amenities and infrastructure. Out of Abu Dhabi, ADGM is further enhancing its attractiveness as a preferred destination for professionals and investors alike.\n\nIn its 2024 Outlook, a comprehensive survey conducted among the ADGM community provides insight into the promising prospects for ADGM as a preferred destination. A total of 70.81% of companies anticipate expanding their workforce in ADGM during 2024, with 29.93% expecting significant increases and 40.88% planning moderate growth in staffing. This collective optimism reflects Abu Dhabi's robust economic health and the strong confidence within the business community in the conducive business environment of the IFC.\n\nEmpowering UAE Nationals: ADGM Academy's Success in Professional Placement\n\nDuring Q1 2024 the ADGM Academy has achieved further success in training and placing hundreds of Emirati nationals in professional job profiles across various companies in the UAE. Through rigorous and comprehensive training programs, the academy has equipped these individuals with the necessary skills and knowledge to excel in their chosen fields. As a result, they have seamlessly integrated into the workforce, contributing to the growth and success of their respective companies, and bolstering the talent pool in the UAE.\n\nAdvancing Blockchain Innovation\n\nFollowing the introduction of the DLT Foundations Regulations, ADGM signed a strategic partnership with Solana Foundation, a non-profit organisation dedicated to decentralisation, adoption, and security on Solana network. This significant partnership is dedicated to enhancing Distributed Ledger Technology (DLT) solutions and advancing blockchain innovation. The initiative aligns with ADGM’s strategic vision of becoming a central hub for technology-driven financial services.\n\nContributing to Global Regulatory Dialogue\n\nThrough proactive measures in enhancing regulatory frameworks and investor confidence ADGM continues to play a pivotal role in fostering financial stability and driving economic growth, through regulatory collaboration with the world’s leading regulators. Hence the Registration Authority (RA) of ADGM became a member of the International Forum of Independent Audit Regulators (IFIAR), reinforcing its commitment to sustaining regulatory frameworks and allocating resources that actively foster excellence in audit practices that help serve the public interest.\n\nManaging a Seamless Migration of Reem Island Businesses\n\n2024 is the year of transitioning businesses on Al Reem Island for ADGM, which is progressing smoothly and is well underway with several initiatives being announced and implemented during Q1 2024 to support the businesses migration process.\n\nIn addition to a series of awareness sessions and focus group meetings organised by the RA of ADGM for representatives of businesses on Al Reem Island, ADGM launched its information centre in Shams Boutik Mall, in Al Reem Island. This centre is offering comprehensive support and actively gathering feedback to engage with businesses and provide step-by-step guidance for registration within ADGM.\n\nThe launch of the centre was followed by ADGM’s first community event on Al Reem Island. Over 500 representatives from diverse businesses based on Al Reem Island participated in the event. Additionally, officials from the Abu Dhabi Department of Economic Development (ADDED) and the Department of Municipalities and Transport – Abu Dhabi (DMT), were present to interact and engage with the attendees.\n\nThe community event provided a platform for ADGM to unveil a new incentive initiative tailored exclusively for businesses based on Al Reem Island, operating in non-financial and retail sectors. Under this incentive initiative, eligible businesses on the island will be relieved from any fees associated with acquiring an ADGM commercial licence until October 31, 2024. This proactive measure is designed to facilitate a seamless transition for these businesses, allowing them to sustain their operations without additional financial obligations as they transition from being an ADDED licensed entity to an ADGM one.\n\n download Arabic",
      "tags": [
        "abu dhabi",
        "al reem island",
        "the number",
        "uae",
        "assets under management"
      ],
      "url": "https://www.adgm.com/media/announcements/adgm-sees-a-record-surge-of-211-percent-in-aum"
    },
    {
      "title": "Cessation of activities by Venom Foundation in ADGM",
      "date": "17/05/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nCessation of activities by Venom Foundation in ADGM\nADGM 17/05/2024\n\nThe Registration Authority (RA) of Abu Dhabi Global Market (ADGM) wishes to inform members of the public that Venom Foundation, an ADGM registered foundation with registration number 000008382 (Venom Foundation ADGM), is no longer conducting any activities in ADGM having voluntarily cancelled its commercial licence in February 2024 and appointed a liquidator in March 2024 to wind down the foundation.\n\nIn addition to Venom Foundation ADGM, associated ADGM companies Venom Blockchain Holding Limited with registration number 000007380 and Venom Blockchain Holding 2 Limited with registration number 000010061 also appointed a liquidator in March 2024 to wind down those companies.\n\nThe RA wishes to alert members of the public that Venom Foundation ADGM and the associated ADGM companies are not associated with activities mentioned in recent social media announcements concerning the launch of Venom Blockchain. References in the recent social media to Venom Foundation are not to Venom Foundation ADGM.\n\nFor further information, please view the media release issued by Venom Foundation ADGM here: Cessation of activities by Venom Foundation in ADGM.",
      "tags": [
        "venom foundation",
        "venom foundation adgm",
        "registration number",
        "ra",
        "abu dhabi global market"
      ],
      "url": "https://www.adgm.com/media/announcements/cessation-of-activities-by-venom-foundation-in-adgm"
    },
    {
      "title": "Liminal Secures Key ADGM FSP License, Reinforcing Leadership in Digital Asset Custody",
      "date": "14/05/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nLiminal Secures Key ADGM FSP License, Reinforcing Leadership in Digital Asset Custody\nADGM 14/05/2024\nDisclaimer\nThis is an external communication and is not an official statement or announcement from ADGM.\n\nLiminal Custody Solutions, a leading provider of digital asset custody and wallet infrastructure solutions, announced a landmark achievement today, the acquisition of Financial Services Permission (FSP) from the Abu Dhabi Global Market (ADGM) Financial Services Regulatory Authority (FSRA). This prestigious license is a significant milestone in Liminal's journey, solidifying its commitment to regulatory compliance and innovation within the burgeoning digital asset space.\n\nObtaining the FSP positions Liminal as a trusted partner for institutions seeking secure and compliant solutions for safeguarding their valuable digital assets. Notably, the license grants Liminal the ability to operate as a regulated custodian within the Middle East, a rapidly growing financial hub. This expansion broadens Liminal's reach and allows it to serve a wider range of clientele seeking best-in-class digital asset custody solutions.\n\nBuilding Trust Through Regulatory Compliance\n\nMahin Gupta, Founder of Liminal Custody Solutions, expressed his satisfaction with the achievement, stating, \"We are honored to receive the ADGM FSP license. This accomplishment represents the culmination of significant effort on behalf of our entire team, all dedicated to upholding the highest regulatory standards. Building trust within the digital asset industry, which is undergoing rapid evolution, is a core tenet of our mission. The ADGM FSP license serves as a powerful validation of our commitment to compliance. We are confident that this achievement will further empower us to deliver best-in-class custody solutions to our clients, ensuring the continued security and integrity of their digital asset holdings.\"\n\nThe Symbiosis of Compliance and Innovation\n\nThe digital asset industry is experiencing exponential growth, with a corresponding demand for regulatory clarity to foster long-term stability and mainstream adoption. Liminal believes that a robust regulatory framework, when coupled with continuous innovation, is the cornerstone for building a secure and thriving digital asset ecosystem. By adhering to stringent regulations, Liminal ensures the safety and security of client assets, while its unwavering commitment to innovation allows it to develop cutting-edge solutions that address the evolving needs of the digital asset landscape. This two-pronged approach – prioritizing both regulatory compliance and technological advancement – positions Liminal as a leader in the digital asset custody space.\n\nCommenting on Liminal achievement, Arvind Ramamurthy, Chief of Market Development at ADGM said: \" We congratulate Liminal on completing its licensing process and receiving the required Financial Services Permission (FSP) from the FSRA of ADGM. Liminal’s focus on regulatory compliance and innovative solutions in the space of digital assets aligns with ADGM’s vision for fostering a dynamic and trusted financial ecosystem that prioritizes upholding the highest standards of security and innovation. We look forward to witness Liminal’s contribution to the growth of the digital asset industry in Abu Dhabi and beyond.”\n\nAmir Tabch, CEO of Liminal Custody Solutions Middle East and Senior Executive Officer of the Category 3C ADGM-regulated entity First Answer Middle East Limited, remarked: \"Earning the ADGM FSP license is a clear indicator of Liminal's ironclad dedication to compliance and innovation. This achievement not only positions us at the forefront of digital asset custody but also signals our pivotal role in its future evolution. By equally valuing regulatory compliance and technological progress, we aim to equip institutions with the confidence to explore the digital asset realm, tapping into its vast, transformative potential. This milestone is a springboard for Liminal's continued growth and a significant contribution towards the digital asset industry's maturity\"\n\n download Arabic",
      "tags": [
        "liminal",
        "liminal custody solutions",
        "financial services permission",
        "fsp",
        "digital asset custody"
      ],
      "url": "https://www.adgm.com/media/announcements/liminal-secures-key-adgm-fsp-license"
    },
    {
      "title": "Blockdaemon expands presence in Abu Dhabi with established entity under Registration Authority of Abu Dhabi Global Market (ADGM)",
      "date": "13/05/2024",
      "source": "ADGM RA",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nBlockdaemon expands presence in Abu Dhabi with established entity under Registration Authority of Abu Dhabi Global Market (ADGM)\nADGM RA 13/05/2024\nDisclaimer\nThis is an external communication and is not an official statement or announcement from ADGM.\n\nBlockdaemon Greenlit by ADGM, Paving the Way for UAE Expansion Strategy\n\nBlockdaemon, the leading institutional-grade blockchain infrastructure company, announced today it is further expanding its presence in the UAE, including setting up an office and establishing an entity in Abu Dhabi under Registration Authority of Abu Dhabi Global Market (ADGM).\n\nThe expansion to operate and provide Web3 infrastructure solutions in the UAE will include making available its node and validator infrastructure solutions locally, as well as their self-hosted MPC wallet technology.\n\n\"This marks a significant stride for Blockdaemon in bolstering its presence in the UAE and deepening our partnership with local regulators and clients,\" said Amor Sexton, COO of Blockdaemon. \"With Blockdaemon receiving approval from the Registration Authority of ADGM, we are not only solidifying our foothold in the region as the leading Web3 infrastructure provider but also affirming our commitment to supporting institutions with blockchain infrastructure. This approval underscores our dedication to operating with integrity and trustworthiness.”\n\nKonstantin Richter, CEO and Founder of Blockdaemon commented, “As we continue to expand our operations and deepen our partnerships across the globe, this milestone paves the way for greater collaboration and innovation in the UAE's vibrant blockchain ecosystem. We are excited about the opportunities ahead and remain steadfast in our mission to empower businesses and organizations with secure and scalable blockchain infrastructure solutions.\"\n\nArvind Ramamurthy, Chief of Market Development at ADGM said, “We congratulate Blockdaemon on receiving their licensing from ADGM to establish their presence in Abu Dhabi. The decision of a prominent institutional-grade blockchain infrastructure company to expand in this region with ADGM underscores the progressive regulatory environment offered by our international financial centre, as well as the significant potential and demand within the blockchain and Web3 sub-cluster and associated services. ADGM has been a pioneer in creating an ecosystem conducive to the growth and success of companies like Blockdaemon, and we eagerly anticipate the opportunities they can unlock within this region.”\n\nBlockdaemon was founded by Konstantin Richter in 2017, to bring institutional-grade infrastructure to blockchain protocols, crypto native and traditional financial institutions. Blockdaemon expanded into the Asia-Pacific region in February 2022 and shortly thereafter in March 2022, expanded to the EMEA region. This latest announcement follows significant geographic growth and product innovation at Blockdaemon, with the Builder Vault utilizing our advanced MPC technology in June 2022, Blockdaemon Wallet in April 2023 and Blockdaemon's Indexed-Data Powered API Suite last March.\n\n download Arabic",
      "tags": [
        "blockdaemon",
        "abu dhabi",
        "uae",
        "abu dhabi global market",
        "konstantin richter"
      ],
      "url": "https://www.adgm.com/media/announcements/blockdaemon-expands-presence-in-abu-dhabi-with-established-entity-under-ra-of-adgm"
    },
    {
      "title": "Klumi Ventures UAE's First Web3 Venture Capital Firm Regulated by ADGM",
      "date": "03/05/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nKlumi Ventures UAE's First Web3 Venture Capital Firm Regulated by ADGM\nADGM 03/05/2024\nDisclaimer\nThis is an external communication and is not an official statement or announcement from ADGM.\nKlumi Ventures received first of its kind financial licence which permits the firm to invest in tokens as well as equity investments in early stage Web3 startups.\nKlumi is launching a $100 Million fund tailored for emerging technologies and decentralized sectors.\nAnother specialised fund will be a $15 Million Qualified Investors Fund slated for pre-seed and seed investments for early-stage Web3 startups.\n\nKlumi Ventures proudly announces its achievement as the United Arab Emirates' pioneering Web3 venture capital firm regulated by the Financial Services Regulatory Authority (FSRA) of Abu Dhabi Global Market (ADGM). This event heralds a new era of innovation and investment opportunities in the region's digital asset ecosystem, as Klumi Ventures leads the charge in fostering growth and empowerment in the Web3 sector.\n\n\"Klumi Ventures is honoured to be at the forefront of shaping the UAE's digital asset landscape as the first Web3 venture capital firm regulated by the FSRA. We are proud to lead this transformative journey, shaping the future of Web3 investment and entrepreneurship in the Middle East and beyond. With ADGM's support and the dynamic ecosystem in Abu Dhabi, we are dedicated to unlocking new avenues of growth and opportunity for Web3 startups\", commented Kristiina Lumeste, Senior Executive Officer of Klumi Ventures.\n\nKlumi Ventures is launching two specialized funds, the $15 Million Qualified Investors Fund is slated for pre-seed and seed investments, providing early-stage Web3 startups with crucial capital and support to realize their vision and scale their operations effectively. The flagship $100 Million fund is tailored to emerge technologies and decentralized sectors.\n\nKristiina Lumeste added, \"Abu Dhabi's status as a global leading city and the 'Capital of Capital' presents unparalleled opportunities for growth and innovation in the digital asset space”.\n\nArvind Ramamurthy, Chief of Market Development at ADGM said, “We welcome Klumi to ADGM’s dynamic and progressive international financial centre. Its establishment as a Web3 Venture Capital Fund and bringing million-dollar specialized funds that fill a critical gap in the Web3 sector's needs, positions Klumi strongly to harness the immense potential of this sector, not only in Abu Dhabi but also throughout the region. Coupled with ADGM’s regulatory capabilities, Klumi’s strategic approach can contribute greatly to the growth of the Web3 sector in the UAE and beyond. We look forward to Klumi’s journey in the UAE’s evolving digital asset landscape.”\n\nADGM's progressive Capital Markets Framework, coupled with its familiar legal and regulatory frameworks, offers a conducive environment for fund managers to thrive while adhering to international standards. Since May 2023, a total of 96 fund and asset management firms and funds have registered and operated in ADGM, highlighting the city's growing importance as a financial hub.\n\n download Arabic",
      "tags": [
        "klumi ventures",
        "klumi",
        "abu dhabi",
        "uae",
        "klumi ventures uae's"
      ],
      "url": "https://www.adgm.com/media/announcements/klumi-ventures-uaes-first-web3-venture-capital-firm-regulated-by-adgm"
    },
    {
      "title": "Abu Dhabi Global Market and Hacken Forge Partnership to Elevate Blockchain Security Standards",
      "date": "24/04/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nAbu Dhabi Global Market and Hacken Forge Partnership to Elevate Blockchain Security Standards\nADGM 24/04/2024\n\nAbu Dhabi Global Market (ADGM), the international financial centre of the UAE’s capital, and Hacken, a global leader in blockchain security auditing, have signed a Memorandum of Understanding (MoU) to collaboratively set new benchmarks for blockchain security and compliance. This strategic partnership reflects a unique synergy between a regulatory body and a security auditor aimed at establishing a world-leading security assessment standard in the blockchain industry.\n\nUnder the MoU, ADGM’s Registration Authority (RA) will collaborate with Hacken on developing security standards and on-chain monitoring solutions in relation to ADGM’s DLT Foundations framework, positioning both organisations at the forefront of fostering a secure blockchain ecosystem. This collaboration not only highlights ADGM's role in innovating regulatory frameworks but also Hacken's commitment to advancing blockchain security globally.\n\nHighlights of the MoU include collaboration in the following areas:\n\nSecurity and Compliance Standards Development\nAdvanced DLT Foundation Monitoring Arrangements\nDevelopment of AI-Enhanced Monitoring Solutions\n\n“At ADGM, we are committed to setting unprecedented global standards in regulatory compliance and security by harnessing the transformative power of blockchain and AI. Our partnership with Hacken exemplifies our innovative drive and dedication to excellence. By integrating AI-driven technologies, we are pioneering a model of regulatory excellence that enhances transparency, security, and trust across the digital landscape. This represents the next frontier in SupTech, and take pride in spearheading this evolution,” said Hamad Sayah Al Mazrouei, CEO of ADGM RA.\n\nDyma Budorin, Co-Founder and CEO of Hacken emphasized the significance of the collaboration stating, \"We are incredibly grateful for the opportunity to support ADGM in this pioneering venture. Our experience in working with public sectors, such as our audits for the European Blockchain Services Infrastructure and our cooperation with government entities, provides a solid foundation for this partnership. Together, we are setting a new global standard for blockchain security and compliance.\"\n\n download Arabic",
      "tags": [
        "hacken",
        "abu dhabi global market",
        "blockchain security",
        "ra",
        "hamad sayah al mazrouei"
      ],
      "url": "https://www.adgm.com/media/announcements/adgm-and-hacken-forge-partnership-to-elevate-blockchain-security-standards"
    },
    {
      "title": "Peninsula receives In Principle Approval from the ADGM FSRA",
      "date": "23/04/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nPeninsula receives In Principle Approval from the ADGM FSRA\nADGM 23/04/2024\nDisclaimer\nThis is an external communication and is not an official statement or announcement from ADGM.\n\nSubject to final FSRA approval, Peninsula aims to become the first internally managed REIT in the ADGM and GCC\n\nPeninsula today announced that it has been granted an In-Principle Approval (IPA) by the Financial Services Regulatory Authority (FSRA) of the Abu Dhabi Global Market (ADGM).\n\nPeninsula, founded in 2019 and incorporated in ADGM, is a real estate investment company focused on industrial, logistics and commercial assets.\n\nSubject to final regulatory approval from the FSRA, Peninsula will become the first internally managed Real Estate Investment Trust (REIT) to establish in the ADGM or the wider GCC market. Internally managed REITs are the preferred structure for investors globally.\n\nStrategic investors into Peninsula include Yas Holding, BHM Capital and HT Investments. Peninsula has been working closely with the Abu Dhabi Investment Office (ADIO) since 2021, which has helped expand the company’s investment and research capabilities from its headquarters in the UAE capital. The HQ is managed by a highly experienced team with a proven track record across the regional real estate investment and management value chain.\n\nBadr Al-Olama, Director General of ADIO, commented: “We congratulate Peninsula on this important milestone, and we are confident that the company will play an important role in supporting Abu Dhabi’s tech drive across key sectors, promoting the Emirate's diversification efforts in line with its Falcon Economy vision. Our partnership with Peninsula is one that cuts across technology, real estate and financial services, providing advanced services to users in the UAE and across the GCC.”\n\nArvind Ramamurthy, Chief of Market Development at ADGM said, “ADGM congratulates Peninsula on receiving its In-Principle Approval from the FSRA. Their expansion within the international financial centre within a few years is a testament to the immense opportunities available within Abu Dhabi. We look forward to Peninsula receiving their Financial Services Permission (FSP) to become fully operational as the first internally managed REIT in ADGM and achieve greater success in the UAE and beyond.\"\n\nMurshed Al Redaini, Chairman of Peninsula, said, “We are pleased to announce this important milestone for Peninsula. Our In Principle Approval from the FSRA marks a meaningful step in our strategic plan to become the first internally managed REIT in the GCC. We thank the ADGM and ADIO for their strong support and partnership.”\n\nADGM is one of the world’s leading international financial centres, located in the capital city of the United Arab Emirates (UAE). The ADGM is an ideal centre for asset management due to its exceptional infrastructure, robust regulatory framework, supportive local government, sound regulation, and the direct application of English Common Law.\n\n download Arabic",
      "tags": [
        "peninsula",
        "fsra",
        "the adgm",
        "gcc",
        "uae"
      ],
      "url": "https://www.adgm.com/media/announcements/peninsula-receives-in-principle-approval-from-the-adgm-fsra"
    },
    {
      "title": "ADGM Wins 'Most Trusted Financial Centre Brand, Middle East' at Global Brand Awards 2024",
      "date": "18/04/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nADGM Wins 'Most Trusted Financial Centre Brand, Middle East' at Global Brand Awards 2024\nADGM 18/04/2024\n\nAbu Dhabi Global Market (ADGM) clinches the top spot as the \"Most Trusted Financial Centre Brand, Middle East” award for 2024 at the distinguished Global Brand Awards.\n\nThe esteemed Global Brand Awards, an annual ceremony organised by Global Brands Magazine (GBM) headquartered in England, celebrates international brands that excel across various industries annually. GBM conducted a thorough evaluation, assessing numerous criteria such as Customer Trust and Satisfaction, Innovation and Technology, Regulatory Compliance, and Brand Value, among others. ADGM showcased outstanding performance in this assessment, underscoring its excellence and meriting commendation from Global Brands Magazine.\n\nCommenting on winning the award, Jay Reddy, Director of Global Brands Magazine said, “We are delighted to recognize ADGM as the winner of the 'Most Trusted Financial Centre Brand' in the Middle East. ADGM's commitment to excellence, innovation, and integrity has positioned it as a beacon of trust and reliability in the region's financial landscape, setting a benchmark for others to follow.”\n\nCommenting on winning the award, Salem Mohammed Al Darei, CEO of ADGM Authority said, “Trust is not just a value but the cornerstone of ADGM's identity. Being recognized by the reputed Global Brands Magazine as the \"Most Trusted Financial Centre Brand, Middle East” underscores the remarkable growth of ADGM and Abu Dhabi as a financial powerhouse, extending our influence beyond regional boundaries. We are on a path to keep soaring high as we set new ambitious goals and elevate Abu Dhabi as the 'Capital of Capital,' solidifying its position among the world's premier international financial centres.\"\n\n download Arabic",
      "tags": [
        "global brands magazine",
        "global brand awards",
        "abu dhabi",
        "middle east",
        "gbm"
      ],
      "url": "https://www.adgm.com/media/announcements/adgm-wins-most-trusted-financial-centre-brand-middle-east-2024"
    },
    {
      "title": "Venture Capital fund manager Token Bay Capital granted IPA to invest in tokens with first of its kind license in ADGM",
      "date": "18/04/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nVenture Capital fund manager Token Bay Capital granted IPA to invest in tokens with first of its kind license in ADGM\nADGM 18/04/2024\nDisclaimer\nThis is an external communication and is not an official statement or announcement from ADGM.\n\nToken Bay Capital Limited (\"Token Bay\") is expanding its venture capital footprint in the capital of the UAE and has been granted an in-principle approval (IPA) from the Financial Services Regulatory Authority (FSRA) to carry out regulated activities in the ADGM. Subject to final regulatory approval for the grant of the Financial Services Permission (FSP), Token Bay brings niche capabilities to manage both token and equity investments in early-stage crypto start-ups under the FSRA's Venture Capital Fund Manager (VCFM) framework.\n\nFounded in 2021, Token Bay is a leading Crypto Venture Capital Fund that has adopted a regulatory-first approach from day one. Token Bay invests in start-ups building next-generation blockchain infrastructure and decentralized applications for Web3. Building on the success of its first fund, Token Bay is now launching its second fund and will continue to back outstanding entrepreneurs building infrastructure solutions for the new token economy. In addition to Abu Dhabi, Token Bay also has offices in Hong Kong, and is strategically positioned across digital assets hubs in both the Middle East and Asia.\n\nFounder and Managing Partner of Token Bay, Lucy Gazmararian: \"This marks the first phase of global expansion for Token Bay, and we're excited to have been granted the IPA in ADGM for venture capital investment in tokens as well as in equity. Blockchain technology has the potential to drive innovation through tokenization, and as blockchain networks continue to evolve, it is important that as venture capitalists we are fully equipped to support talented founders building in Web3 by directly participating in these networks and taking an ownership stake through tokens. We extend our sincerest thanks to the regulator for their forward- thinking approach and open dialogue so that we were able to reach this important milestone and establish Token Bay in one of the world's leading international financial centres and digital assets hub.\"\n\nADGM's progressive regulatory framework, English common law legal framework, status as a leading centre for financial innovation and vibrant blockchain and digital assets ecosystem have attracted Token Bay to set up offices in the capital of the UAE.\n\nArvind Ramamurthy, Chief of Market Development at ADGM said, \"We extend a warm welcome to Token Bay Capital as they join ADGM's international financial centre and commence their establishment in Abu Dhabi, marking the beginning of their global expansion journey. ADGM is dedicated to cultivating innovation and excellence in the financial sector, particularly within the virtual asset space. With progressive regulatory frameworks that facilitate companies like Token Bay Capital, ADGM's vibrant ecosystem stands as the optimal platform for initiating their global growth trajectory.\"\n\nToken Bay's Venture Funds offer institutions, multi-national companies, private banks, family offices and high-net-worth individuals the opportunity to invest in an emerging asset class right at the start of a multi-decade cycle.",
      "tags": [
        "token bay",
        "abu dhabi",
        "ipa",
        "tokens",
        "venture capital"
      ],
      "url": "https://www.adgm.com/media/announcements/token-bay-capital-granted-ipa-with-first-of-its-kind-license-in-adgm"
    },
    {
      "title": "Varys Capital Ventures (CEIC) Limited is set to launch in the ADGM",
      "date": "17/04/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nVarys Capital Ventures (CEIC) Limited is set to launch in the ADGM\nADGM 17/04/2024\nDisclaimer\nThis is an external communication and is not an official statement or announcement from ADGM.\n\nVarys Capital (“Varys”) has partnered with FundRock Investment Management Services (ME) Ltd (“FundRock”), a fund management company, licensed by the FSRA, to manage a feeder fund, Varys Capital Ventures (CEIC) Limited in the Abu Dhabi Global Market (ADGM).\n\nThe feeder fund will invest its assets into a Master Fund (“Fund”), which was initially established as an early-stage, equity-focused venture fund with a mandate centered around blockchain innovation, Web3, and infrastructure. The Fund has identified commitments across DeFi, GameFi/Web3, Infrastructure, and Emerging Technologies, all centred around blockchain.\n\nVarys will invest in multiple domestic companies and has entered the UAE because of the local government's supportive directives, the country's high level of innovation, robust local infrastructure, and forward-thinking minds. Since securing initial investment from prominent family offices, institutions, and high-net-worth investors, Varys has actively closed the gap on its $75m round.\n\nThe feeder fund’s appointed investment manager, legal counsel, fund administrator, and auditor are FundRock, Al Tamimi, Apex Fund Services (AD) Limited, and Crowe Mak LLP, respectively.\n\nDarius Askaripour, Director of Varys Capital, said “Due to the government's leadership and vision, ADGM has created limitless opportunities and attracted the most brilliant and talented minds in the digital asset space. As a unique venture fund with the capacity to quantitatively execute deals, we are honoured to be a significant contributing entity in the region. We have immediate plans for deployment, adding to our high-performing portfolio and reinforcing the global appeal of the United Arab Emirates as the nation continues to expand the wide use cases of blockchain technology.”\n\nMatthew Pykstra from FundRock, said “We are thrilled to have partnered with Varys Capital on this feeder fund and are enthusiastic about the diverse offering that the fund brings to the region”\n\nArvind Ramamurthy, Chief of Market Development at ADGM, said “We congratulate Varys and FundRock on joining hands to manage a feeder fund, here in the ‘Capital of Capital’ - Abu Dhabi. This initiative aligns with ADGM's growth strategies for the digital assets space, focusing on progressive regulations and initiatives encompassing DeFi, Blockchain, and other related sub-clusters.\n\nADGM’s vibrant community includes a range of domestic companies in the new-age finance sector, and we look forward to this fund strategically bridging the investment gap for these companies that will foster significant growth within the sector and enhance overall industry development.\"\n\n download Arabic",
      "tags": [
        "varys capital",
        "varys capital ventures",
        "fundrock",
        "varys",
        "fundrock investment management services"
      ],
      "url": "https://www.adgm.com/media/announcements/varys-capital-ventures-ceic-limited-is-set-to-launch-in-the-adgm"
    },
    {
      "title": "FJ Labs-backed hedge fund, Triton Liquid, selects ADGM as global headquarters",
      "date": "16/04/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nFJ Labs-backed hedge fund, Triton Liquid, selects ADGM as global headquarters\nADGM 16/04/2024\nDisclaimer\nThis is an external communication and is not an official statement or announcement from ADGM.\nTriton Liquid, funded by leading US venture capital investors, has received an In-Principal Approval for a Financial Services Permission (FSP)\nTriton’s launch will open greater access to more sophisticated, liquid, institutional-grade digital asset projects to Middle East investors, stimulating further economic diversification in the UAE\nTriton cites the UAE’s “visionary leadership, financial services pedigree and constant drive for fintech innovation” as motivation for the move to Abu Dhabi\nTriton Liquid is funded and incubated by New York-based FJ Labs, whose investments include major global financial services and marketplaces, such as Alibaba, Betterment, Stripe, Revolut, Klarna, and UAE Future 100 company, ABHI\n\nTriton Liquid, a digital assets hedge fund, has established its global headquarters in Abu Dhabi and has received an In-Principal Approval for an FSP, from the Financial Services Regulators (FSRA) of Abu Dhabi Global Market (ADGM). The launch will provide a best-in-class, tailored platform for Middle Eastern investors seeking to capitalize on the growth of blockchain technology and cryptocurrency adoption.\n\nAccording to 2023 Chainalysis data, the Middle East and North Africa (MENA) region reported a staggering $389.8 billion in on-chain crypto value between July 2022 and June 2023, representing almost 7.2% of global transaction volume. The UAE continues to lead the path with one of the highest rates of global digital assets adoption1, making it a natural home for Triton’s operations.\n\nAs the UAE emerges as a globally recognized centre for digital assets innovation and demand for tokens grows, Triton Liquid is poised to provide investors with access to token liquidity, rigorous data-driven digital assets analysis, and robust portfolio diversification.\n\nFounded by MIT and Princeton alumni, Triton Liquid’s methodology combines fundamental venture capital (VC) principles with deep proprietary data analysis to invest in liquid tokens across the entire digital asset landscape. The result is a portfolio that generates venture-like returns with public markets’ liquidity.\n\nTheir investment edge is that they have built proprietary dashboards over the past two years that track relevant metrics across 24 digital asset verticals and combine it with ⁠VC-style due diligence with 20+ page deal memos for each project.\n\nUnlike traditional venture and equity investment models, where performance projects are based on retrospective quarterly or half-yearly earnings, Triton Liquid tracks live, open-source data, generating real-time insights and forecasts, equipping investors with far greater oversight and transparency.\n\nThis strategy was developed by their digital assets-native team that has built crypto products, decentralized exchanges, and digital asset hedge funds prior, where the fund partner has invested across three crypto investment cycles.\n\nAs of March 2024, Triton realized a 108% return since inception, after increasing their market exposure from 20% to 100% since November 2023.\n\nFabrice Grinda, Founder Partner at FJ Labs, comments; “Digital assets is the ultimate network effect business and a perfect complement to our core efforts. We believe that Triton’s proprietary evaluation process will offer venture-style returns in this emerging asset class, and we are delighted to be part of the Triton story in ADGM’s burgeoning digital assets ecosystem.”\n\nChris Keshian, Founder and CIO of Triton Liquid - and formerly FJ Labs’ Head of Liquid Digital Assets - is the architect of the fund and its liquid token strategy. Based in Abu Dhabi, Chris will be responsible for building and scaling operations in the region and driving the overall growth of the business.\n\nChris is a true digital asset native, having been an active investor and trader in the cryptocurrency space since 2013. In 2014, he co-founded the first fiat gateway onto Ethereum, showcasing his acute understanding of emerging blockchain technologies. Building on this success, Chris further established a long/short cryptocurrency-focused hedge fund in San Francisco in 2016. Today, he is bringing his extensive experience to Abu Dhabi’s thriving digital assets ecosystem\n\nChris Keshian, Founder and Chief Investment Officer at Triton Liquid says: “The liquid digital assets market has evolved rapidly over the last ten years, and now sits at the cross-section of venture investing and public equity investing. Most projects are early stages but have an actively traded token that represents ownership or value accrual for the company. As such, through applying a venture style research process with a public equity style data due diligence and rebalancing process, we have created a strategy which we believe provides the best exposure to the growth and liquidity of this asset class.”\n\n“The UAE is undoubtedly becoming the global hub for digital assets and the broader DeFi industry,” Chris adds. “The fintech ecosystem in the UAE is more vibrant than ever, and we look forward to playing an active role in its continued evolution. The UAE’s visionary leadership, financial services pedigree and constant drive for fintech innovation make this market a perfect fit for us. Our launch today marks a major milestone for our company and a crucial inflection point in our growth journey, one which we are delighted to share with our partners at ADGM.”",
      "tags": [
        "triton liquid",
        "uae",
        "fj labs",
        "triton",
        "abu dhabi"
      ],
      "url": "https://www.adgm.com/media/announcements/triton-liquid-selects-adgm-as-global-headquarters"
    },
    {
      "title": "SS&C Expands Fund Administration Business in UAE with the launch of an office in Abu Dhabi",
      "date": "29/03/2024",
      "source": "ADGM",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nSS&C Expands Fund Administration Business in UAE with the launch of an office in Abu Dhabi\nADGM 29/03/2024\nDisclaimer\nThis is an external communication and is not an official statement or announcement from ADGM.\n\nWorld’s leading fund administrator obtains regulatory approval and strengthens its presence in the Middle East.\n\nSS&C Technologies Holdings, Inc. (Nasdaq: SSNC) today announced an expansion of its global footprint with the opening of a new office in Abu Dhabi, United Arab Emirates. The Financial Services Regulatory Authority (FSRA) has granted SS&C full approval to deliver fund administration services within the prestigious Abu Dhabi Global Market (ADGM).\n\nThe newly established office in the Al Maqam Tower within the heart of the ADGM will enable SS&C to offer end-to-end hands-on fund administration services to clients, further solidifying its financial technology and services leader position.\n\nThe fund administration offering in ADGM complements SS&C's full range of services SS&C offers to alternative fund managers in the Middle East. SS&C has a robust track record of serving nearly 850 financial institutions and corporate clients in the region, with 140 clients leveraging its cutting-edge fund administration technology. With the regulatory license to operate in ADGM, SS&C is poised to enhance its offerings with dedicated local experts who will benefit from the full scope of the firm's global expertise.\n\nKatarzyna Lupa-Nowicka (Head of Private Markets Operations, Middle East) and David Forrester (Head of Hedge Operations, Middle East) will lead the new office in Abu Dhabi.\n\n“We are excited to cement our presence in the growing Abu Dhabi Global Market with the new operating license and on-the-ground presence,” said Bill Stone, Chairman and CEO. “With more than $2 trillion in assets under administration, SS&C GlobeOp is the leading fund administrator in the world. We pride ourselves on upholding world-class standards in our technology and service offerings, paired with deep knowledge of local markets and regulations. We look forward to bringing local and global managers looking to invest in Abu Dhabi’s falcon economy flexible, tailored solutions to support their growth.”\n\nArvind Ramamurthy, Chief of Market Development at ADGM said, “We congratulate SS&C Technologies on the inauguration of their office within ADGM, showcasing their steadfast dedication to Abu Dhabi. SS&C's establishment underscores the burgeoning prospects for financial entities, fund managers, and alternative investment firms in the region, affirming Abu Dhabi's appeal as the preferred hub for such companies. With ADGM's robust regulatory framework and an abundance of opportunities within its international financial centre, Abu Dhabi stands resolute as the destination of choice for distinguished companies seeking growth and excellence.\"\n\nAccording to the ADGM FSRA, fund managers based in Abu Dhabi have seen more than 52% growth in assets under management at the end of Q3 2023 compared to the same period the year before, with more than 100 managers operating 128 leading funds. SS&C already services some of the leading funds in the United Arab Emirates.\n\n download Arabic",
      "tags": [
        "abu dhabi",
        "ss&c",
        "ss&c expands fund administration business",
        "uae",
        "ss&c technologies holdings, inc."
      ],
      "url": "https://www.adgm.com/media/announcements/ssc-expands-fund-administration-business-in-uae-with-the-launch-of-an-office-in-abu-dhabi"
    },
    {
      "title": "The Registration Authority of ADGM Publishes Consultation Paper on Legislative Framework for a Register of Certain Trust Information",
      "date": "27/03/2024",
      "source": "ADGM RA",
      "content": "Announcement\nHome\nMedia\nAnnouncements\nThe Registration Authority of ADGM Publishes Consultation Paper on Legislative Framework for a Register of Certain Trust Information\nADGM RA 27/03/2024\n\nThe Registration Authority (RA) of Abu Dhabi Global Market (ADGM) has issued a Consultation Paper to explain and to seek public feedback and comments on the proposed amendments to the Beneficial Ownership and Control Regulations 2022 concerning a non-public register of certain information of express trusts.\n\nThis Consultation Paper is of interest to any persons who have formed, or are considering forming, a trust in ADGM, as well as those administering or advising on such trusts and trust structures whether from a professional trustee perspective, or as legal advisers.\n\nThe key features of the RA’s proposals are as follows:\n\nthe requirements will apply to express trusts with an ADGM trustee who acts by way of business;\nthe information to be maintained in the record of the trust will, in addition to beneficial ownership information, include the name of the trust, the date of its creation and the objectives of the trust;\nthe responsibility for maintaining the record of the trust, and for submitting the same to the Registrar, will be on the trustee; and\nthe trust register will not be accessible by the public.\n\nThis new legislative framework reflects the commitment of the RA and the ADGM to tackle money laundering, terrorist financing and proliferation financing by collecting, and making available to competent authorities, certain information on express trusts.\n\nTo view the Consultation Paper, please click here: Consultation Paper No. 3 of 2024 - Proposal concerning Registration of certain Trusts Particulars.\n\nThe consultation period will close on 21 April 2024.",
      "tags": [
        "legislative framework",
        "the trust",
        "the registration authority",
        "ra",
        "the registration authority of adgm publishes consultation paper"
      ],
      "url": "https://www.adgm.com/media/announcements/ra-publishes-consultation-paper-on-legislative-framework-for-a-register-of-certain-trust-information"
    }
  ]
}